{"paper_id": "c28f76835909d9556c4f74299605c398ed79e25b", "metadata": {"title": "Structural basis for the dimerization and substrate recognition specificity of porcine epidemic diarrhea virus 3C-like protease", "authors": [{"first": "Gang", "middle": [], "last": "Ye", "suffix": "", "affiliation": {"laboratory": "State Key Laboratory of Agricultural Microbiology", "institution": "Huazhong Agricultural University", "location": {"settlement": "Wuhan", "region": "Hubei", "country": "China"}}, "email": ""}, {"first": "Feng", "middle": [], "last": "Deng", "suffix": "", "affiliation": {"laboratory": "State Key Laboratory of Agricultural Microbiology", "institution": "Huazhong Agricultural University", "location": {"settlement": "Wuhan", "region": "Hubei", "country": "China"}}, "email": ""}, {"first": "Zhou", "middle": [], "last": "Shen", "suffix": "", "affiliation": {"laboratory": "State Key Laboratory of Agricultural Microbiology", "institution": "Huazhong Agricultural University", "location": {"settlement": "Wuhan", "region": "Hubei", "country": "China"}}, "email": ""}, {"first": "Rui", "middle": [], "last": "Luo", "suffix": "", "affiliation": {"laboratory": "State Key Laboratory of Agricultural Microbiology", "institution": "Huazhong Agricultural University", "location": {"settlement": "Wuhan", "region": "Hubei", "country": "China"}}, "email": ""}, {"first": "Ling", "middle": [], "last": "Zhao", "suffix": "", "affiliation": {"laboratory": "State Key Laboratory of Agricultural Microbiology", "institution": "Huazhong Agricultural University", "location": {"settlement": "Wuhan", "region": "Hubei", "country": "China"}}, "email": ""}, {"first": "Shaobo", "middle": [], "last": "Xiao", "suffix": "", "affiliation": {"laboratory": "State Key Laboratory of Agricultural Microbiology", "institution": "Huazhong Agricultural University", "location": {"settlement": "Wuhan", "region": "Hubei", "country": "China"}}, "email": ""}, {"first": "Zhen", "middle": ["F"], "last": "Fu", "suffix": "", "affiliation": {"laboratory": "State Key Laboratory of Agricultural Microbiology", "institution": "Huazhong Agricultural University", "location": {"settlement": "Wuhan", "region": "Hubei", "country": "China"}}, "email": ""}, {"first": "Guiqing", "middle": [], "last": "Peng", "suffix": "", "affiliation": {"laboratory": "State Key Laboratory of Agricultural Microbiology", "institution": "Huazhong Agricultural University", "location": {"settlement": "Wuhan", "region": "Hubei", "country": "China"}}, "email": ""}]}, "abstract": [{"text": "Porcine epidemic diarrhea virus (PEDV), a member of the genus Alphacoronavirus, has caused significant damage to the Asian and American pork industries. Coronavirus 3C-like protease (3CL pro ), which is involved in the processing of viral polyproteins for viral replication, is an appealing antiviral drug target. Here, we present the crystal structures of PEDV 3CL pro and a molecular complex between an inactive PEDV 3CL pro variant C144A bound to a peptide substrate. Structural characterization, mutagenesis and biochemical analysis reveal the substrate-binding pockets and the residues that comprise the active site of PEDV 3CL pro . The dimerization of PEDV 3CL pro is similar to that of other Alphacoronavirus 3CL pro s but has several differences from that of SARS-CoV 3CL pro from the genus Betacoronavirus. Furthermore, the non-conserved motifs in the pockets cause different cleavage of substrate between PEDV and SARS-CoV 3CL pro s, which may provide new insights into the recognition of substrates by 3CL pro s in various coronavirus genera.", "cite_spans": [], "ref_spans": [], "section": "Abstract"}], "body_text": [{"text": "Porcine epidemic diarrhea virus (PEDV), which belongs to the genus Alphacoronavirus in the family Coronaviridae, causes severe diarrhea, vomiting, dehydration and high mortality in neonatal piglets (Song and Park, 2012; Wood, 1977) . PED was first observed in Europe in 1971 (Oldham, 1972) . PEDV was isolated in Belgium in 1976 (Pensaert and de Bouck, 1978) . Since PEDV was first identified, outbreaks have been reported in many swine-producing countries, notably in Europe and Asia. PEDV has recently reemerged, with outbreaks in Asia and North America resulting in enormous economic losses (Pasick et al., 2014; Vlasova et al., 2014; Wang et al., 2014b) . Continuous vaccine efforts have been made and some advances have been achieved since the outbreak (Collin et al., 2015; Song et al., 2015) .", "cite_spans": [{"start": 198, "end": 219, "text": "(Song and Park, 2012;", "ref_id": "BIBREF33"}, {"start": 220, "end": 231, "text": "Wood, 1977)", "ref_id": "BIBREF45"}, {"start": 275, "end": 289, "text": "(Oldham, 1972)", "ref_id": "BIBREF26"}, {"start": 329, "end": 358, "text": "(Pensaert and de Bouck, 1978)", "ref_id": "BIBREF28"}, {"start": 594, "end": 615, "text": "(Pasick et al., 2014;", "ref_id": "BIBREF27"}, {"start": 616, "end": 637, "text": "Vlasova et al., 2014;", "ref_id": "BIBREF40"}, {"start": 638, "end": 657, "text": "Wang et al., 2014b)", "ref_id": "BIBREF41"}, {"start": 758, "end": 779, "text": "(Collin et al., 2015;", "ref_id": "BIBREF6"}, {"start": 780, "end": 798, "text": "Song et al., 2015)", "ref_id": "BIBREF31"}], "ref_spans": [], "section": "Introduction"}, {"text": "There are four genera within Coronaviridae: Alphacoronavirus, Betacoronavirus (A, B, C and D) (de Groot et al., 2012) , Gammacoronavirus, and Deltacoronavirus (Adams and Carstens, 2012) . Transmissible gastroenteritis virus (TGEV), another", "cite_spans": [{"start": 94, "end": 117, "text": "(de Groot et al., 2012)", "ref_id": "BIBREF9"}, {"start": 120, "end": 185, "text": "Gammacoronavirus, and Deltacoronavirus (Adams and Carstens, 2012)", "ref_id": null}], "ref_spans": [], "section": "Introduction"}, {"text": "Alphacoronavirus, causes severe and often fatal diarrhea in young pigs (Garwes, 1988) . The severe acute respiratory syndrome (SARS) coronavirus (lineage B Betacoronavirus) causes a life-threatening disease with a mortality rate of 11% (Weiss and Navas-Martin, 2005) . Another novel lineage C Betacoronavirus, the Middle East respiratory syndrome coronavirus (MERS-CoV), has recently emerged in the Middle East and spread to Europe and other areas, causing a SARS-like infection in humans with a high mortality rate of approximately 40% (Chan et al., 2013) . The coronavirus replicase gene consists of two large open reading frames (ORF1a and ORF1b) located at the 5′ end of the genome. ORF1a encodes the polyprotein pp1a, whereas ORF1a and ORF1b together encode pp1ab Ziebuhr et al., 2000; Ziebuhr, 2005) . The coronavirus 3C-like protease (3CL pro ; non-structural protein 5, Nsp5) is part of the polyproteins pp1a and pp1ab, and this enzyme is encoded by ORF1a. With few exceptions, coronaviruses encode two papain-like proteases (called PL1 pro and PL2 pro , respectively), which are responsible for the cleavage of the N-proximal regions of the polyprotein. The central and C-proximal regions of the polyprotein are cleaved by 3CL pro at 11 conserved sites, and the products are essential for viral replication (Thiel et al., 2001; Thiel et al., 2003; Ziebuhr et al., 2000) . Thus, 3CL pro is an appealing target for the design of anti-coronavirus therapies. Fig. 1 . Crystal structure and sequence alignment of PEDV 3CL pro . A. The overall structure of the PEDV 3CL pro homodimer. Loop A, the N-finger, the C-terminal helix and the active site are shown in black, blue, yellow and magenta, respectively. Loop A, which connects domain II to domain III, is labeled. Catalytic residues H41 and C144 are represented as spheres. B. The structure-based sequence alignment of several coronavirus 3CL pro s. The sequence alignment was conducted with Clustal W and the figure was prepared with ESPript 3 (Robert and Gouet, 2014) . Residues conserved in all 3CL pro s are shown in white on a red background. Residues conserved in most of the sequences are shown in red and boxed with a white background. C. Kinetic parameters of PEDV 3CL pro . The fluorogenic substrate (Dabcyl-YNSTLQ↓AGLRKM-E-Edans) was used in the assays. The initial rates of the protease under different substrate concentrations were used to calculate the kinetic parameters by fitting with the Michaelis-Menten equation using GraphPad Prism5.", "cite_spans": [{"start": 71, "end": 85, "text": "(Garwes, 1988)", "ref_id": "BIBREF11"}, {"start": 236, "end": 266, "text": "(Weiss and Navas-Martin, 2005)", "ref_id": "BIBREF44"}, {"start": 537, "end": 556, "text": "(Chan et al., 2013)", "ref_id": "BIBREF7"}, {"start": 769, "end": 790, "text": "Ziebuhr et al., 2000;", "ref_id": "BIBREF48"}, {"start": 791, "end": 805, "text": "Ziebuhr, 2005)", "ref_id": "BIBREF50"}, {"start": 1316, "end": 1336, "text": "(Thiel et al., 2001;", "ref_id": "BIBREF37"}, {"start": 1337, "end": 1356, "text": "Thiel et al., 2003;", "ref_id": "BIBREF38"}, {"start": 1357, "end": 1378, "text": "Ziebuhr et al., 2000)", "ref_id": "BIBREF48"}, {"start": 2002, "end": 2026, "text": "(Robert and Gouet, 2014)", "ref_id": "BIBREF29"}], "ref_spans": [{"start": 1464, "end": 1470, "text": "Fig. 1", "ref_id": null}], "section": "Introduction"}, {"text": "Coronavirus 3CL pro employs conserved cysteine and histidine residues, which serve as the principal nucleophile and general acid-base catalyst, respectively, at its catalytic site (Anand et al., 2002; Lu et al., 1995; Thiel et al., 2003; Ziebuhr et al., 2000) . An asparagine is the third member of the catalytic triad in proteases of the papain family. Chymotrypsin and other members of this serine protease family possess a catalytic triad (Anand et al., 2002) . However, in coronavirus 3CL pro , there is no third residue involved in catalysis Liu and Brown, 1995; Lu and Denison, 1997) . Notably, a buried water molecular hydrogen-bonded to three surrounding residues takes the place that is normally occupied by the side chain of the third member of the catalytic triad (Anand et al., 2002; Anand et al., 2003; Yang et al., 2003) . Coronavirus 3CL pro recognizes a conserved site containing a hydrophobic residue (preferably L) at the P2 position, a Q at the P1 position, and a small aliphatic amino acid residue (S, G, A) at the P1′ position Hsu et al., 2005; Ziebuhr et al., 2000) . The previously reported nomenclature system was used to describe the residue sites of the peptide substrates and the substrate binding sites of the protease (Schechter and Berger, 1967) .", "cite_spans": [{"start": 180, "end": 200, "text": "(Anand et al., 2002;", "ref_id": "BIBREF2"}, {"start": 201, "end": 217, "text": "Lu et al., 1995;", "ref_id": "BIBREF21"}, {"start": 218, "end": 237, "text": "Thiel et al., 2003;", "ref_id": "BIBREF38"}, {"start": 238, "end": 259, "text": "Ziebuhr et al., 2000)", "ref_id": "BIBREF48"}, {"start": 442, "end": 462, "text": "(Anand et al., 2002)", "ref_id": "BIBREF2"}, {"start": 547, "end": 567, "text": "Liu and Brown, 1995;", "ref_id": "BIBREF18"}, {"start": 568, "end": 589, "text": "Lu and Denison, 1997)", "ref_id": "BIBREF19"}, {"start": 775, "end": 795, "text": "(Anand et al., 2002;", "ref_id": "BIBREF2"}, {"start": 796, "end": 815, "text": "Anand et al., 2003;", "ref_id": "BIBREF3"}, {"start": 816, "end": 834, "text": "Yang et al., 2003)", "ref_id": "BIBREF47"}, {"start": 1048, "end": 1065, "text": "Hsu et al., 2005;", "ref_id": "BIBREF16"}, {"start": 1066, "end": 1087, "text": "Ziebuhr et al., 2000)", "ref_id": "BIBREF48"}, {"start": 1247, "end": 1275, "text": "(Schechter and Berger, 1967)", "ref_id": "BIBREF30"}], "ref_spans": [], "section": "Introduction"}, {"text": "Dimerization is a commonly used strategy for regulating viral protease activity. The formation of a dimer can be the mechanism for enzyme activation. Conversely, dimerization can inhibit an active monomeric enzyme (Marianayagam et al., 2004) . In terms of coronavirus 3CL pro s, only the dimeric form is functional (Chen et al., 2008; Li et al., 2010; Shi et al., 2008) . In the structure of TGEV 3CL pro , the N-terminus of one monomer helps shape the S1 pocket and the oxyanion hole of the opposite monomer; thus, dimerization is essential for its catalytic activity (Anand et al., 2002) . The dimerization and trans-cleavage activity of SARS-CoV 3CL pro are completely inhibited by the E290R and R298E (located at the C-terminal helix) variants and partly inhibited by the R4E (located at the N-terminal loop) variant (Hilgenfeld, 2014) .", "cite_spans": [{"start": 214, "end": 241, "text": "(Marianayagam et al., 2004)", "ref_id": "BIBREF22"}, {"start": 315, "end": 334, "text": "(Chen et al., 2008;", "ref_id": "BIBREF8"}, {"start": 335, "end": 351, "text": "Li et al., 2010;", "ref_id": "BIBREF20"}, {"start": 352, "end": 369, "text": "Shi et al., 2008)", "ref_id": "BIBREF32"}, {"start": 569, "end": 589, "text": "(Anand et al., 2002)", "ref_id": "BIBREF2"}, {"start": 821, "end": 839, "text": "(Hilgenfeld, 2014)", "ref_id": "BIBREF14"}], "ref_spans": [], "section": "Introduction"}, {"text": "To investigate the properties of PEDV 3CL pro , we determined the crystal structure of PEDV 3CL pro , as well as that of an inactive PEDV 3CL pro variant (C144A) bound to a peptide substrate. In addition, we performed biochemical analyses and structural comparisons to provide further insights into the dimerization and substrate specificity of coronavirus 3CL pro .", "cite_spans": [], "ref_spans": [], "section": "Introduction"}, {"text": "The PEDV 3CL pro crystal structure was determined at a high resolution (1.65 Å) in the space group, P2 1 (Fig. 1) . Two molecules are observed in each asymmetric unit, with a root mean square deviation (RMSD) of 0.24 Å for 186 superimposed Cα atoms of domain I and domain II, 0.89 Å for 97 superimposed Cα atoms of domain III (computed through the PDBeFold service on the European Bioinformatics Institute website); the two protomers are oriented at approximately right angles to each other. Each monomer features three domains: domain I (residues 1-97), domain II (residues 98-186), and domain III (residues 202-298). Each of the first two domains exhibits an antiparallel β-barrel structure, which is similar to the 3CL pro s from other coronaviruses (Anand et al., 2002; Needle et al., 2015; Yang et al., 2003) . Domain III consists of five α helices and is connected to domain II by a long loop (residues 187-197, loop A in Fig. 1(A) ). As observed in all of the reported 3CL pro structures, the substrate-binding site near the catalytic dyad is located in a cleft between domains I and II.", "cite_spans": [{"start": 753, "end": 773, "text": "(Anand et al., 2002;", "ref_id": "BIBREF2"}, {"start": 774, "end": 794, "text": "Needle et al., 2015;", "ref_id": "BIBREF25"}, {"start": 795, "end": 813, "text": "Yang et al., 2003)", "ref_id": "BIBREF47"}], "ref_spans": [{"start": 105, "end": 113, "text": "(Fig. 1)", "ref_id": null}, {"start": 928, "end": 937, "text": "Fig. 1(A)", "ref_id": null}], "section": "Overall structure of PEDV 3CL pro"}, {"text": "Structural alignment of the domains of several coronavirus 3CL pro s gives an overall view of the comparison (Fig. 2) . The structures show high similarity, especially in the area around the active site, and several small shifts are found mainly in domain III ( Fig. 2(A) ). The RMSD value (1.2 Å) of domain III between SARS-CoV 3CL pro and PEDV 3CL pro is higher than that (0.7 Å) between the two Alphacoronavirus 3CL pro s and PEDV 3CL pro . The RMSD values of the first two domains between different coronavirus 3CL pro s are relative small (all around 0.7 Å) ( Fig. 2(B) ). These results reveal that SARS-CoV 3 CL pro (Betacoronavirus) demonstrates a relatively high number of structural differences compared with the Alphacoronavirus 3CL pro s, especially in domain III; the first two domains (chymotrypsin-like cores) show higher degrees of conservation compared with that of domain III among different genera of coronavirus.", "cite_spans": [], "ref_spans": [{"start": 109, "end": 117, "text": "(Fig. 2)", "ref_id": "FIGREF0"}, {"start": 262, "end": 271, "text": "Fig. 2(A)", "ref_id": "FIGREF0"}, {"start": 565, "end": 574, "text": "Fig. 2(B)", "ref_id": "FIGREF0"}], "section": "Overall structure of PEDV 3CL pro"}, {"text": "The imidazole ring of H41 of the catalytic dyad adopts a different orientation from that observed in most current coronavirus 3CL pro structures. The imidazole ring of H41 is not in contact with the corresponding nucleophile C144 in PEDV 3CL pro (Fig. S1 ). However, this configuration may be an artifact caused by the low pH (4.2) of crystallization. At this pH, the histidine residue may be protonated and become unable to interact with the sulfhydryl of C144. Such a pH-effect has been previously described for the 3C protease of enterovirus 68 (Tan et al., 2013) .", "cite_spans": [{"start": 548, "end": 566, "text": "(Tan et al., 2013)", "ref_id": "BIBREF36"}], "ref_spans": [{"start": 246, "end": 254, "text": "(Fig. S1", "ref_id": null}], "section": "Overall structure of PEDV 3CL pro"}, {"text": "Tablesimeric form has consistently been shown to be the catalytically active form for all coronavirus 3CL pro s studied to date. At the dimer interface of PEDV 3CL pro , the N-terminal finger (8 residues of the N-terminus) assembles into the dimerization surface, interacting with domain II of the opposite monomer and the C-terminal helix of the same monomer ( Fig. 1(A) ). A total surface area of 2085 Å 2 is buried upon dimerization (computed using PDBePISA tool, http://pdbe.org/pisa/). In this molecule, 16 residues from monomer A are found to interact (hydrogen bonds or salt bridges) with 16 residues from monomer B at the dimer interface (Table 2 and Fig. 3 ). All the residues are conserved among the three Alphacoronavirus 3CL pro s, except three substitutions for the A1, G279 and T281 residues (Table 2) . Meanwhile, extensively hydrophobic interactions appear at the dimer interface. The interactions are mainly observed between the N-terminal residues of one monomer and domain II and domain III of the opposite monomer. The intraprotomer interactions between the two N-terminal loops and between the two domain III are also involved in the dimerization ( Fig. 3(B) ).", "cite_spans": [], "ref_spans": [{"start": 362, "end": 371, "text": "Fig. 1(A)", "ref_id": null}, {"start": 646, "end": 658, "text": "(Table 2 and", "ref_id": null}, {"start": 659, "end": 665, "text": "Fig. 3", "ref_id": "FIGREF1"}, {"start": 806, "end": 815, "text": "(Table 2)", "ref_id": null}, {"start": 1170, "end": 1179, "text": "Fig. 3(B)", "ref_id": "FIGREF1"}], "section": "The dimerization of PEDV 3CL pro"}, {"text": "To explore the relationship between oligomerization and enzymatic activity, four variants (R4A, S138A, R294A, and Q295A) and an N-finger deletion variant at the PEDV 3CL pro dimer interface were constructed. The elution peaks of the four variants show similar retention volumes to that of the wild type (WT) at 9.95 ml (approximately 54 kDa), which represents a dimer form similar to that of WT PEDV 3CL pro (Fig. 4(A) , (B) and (D)). However, the elution peak of the N-finger deletion variant (Δ8aa) shows a retention volume of 11.31 ml (approximately 30.4 kDa), which represents the monomer. The oligomerization of the proteins was further confirmed through sedimentation velocity experiments ( Fig. 4 (C) and (D)). The results were consistent with that of the gel filtration chromatography analysis. The majority (88.90%) of wild type PEDV 3CL pro exists as dimers, and few (5.24%) exists as monomers. The four variants still primarily exist as dimers, however the relative populations of the variants monomers, except S138A, increased slightly. The majority (90.92%) of the N-finger deletion variant exists as monomers. These data indicate that wild type PEDV 3CL pro primarily exists as dimers in solution and the engineered variants (R4A, S138A, R294A, and Q295A) show little effect on the monomer-dimer equilibrium. The N-finger deletion absolutely disrupts the dimerization.", "cite_spans": [], "ref_spans": [{"start": 408, "end": 418, "text": "(Fig. 4(A)", "ref_id": null}, {"start": 697, "end": 703, "text": "Fig. 4", "ref_id": null}], "section": "The dimerization of PEDV 3CL pro"}, {"text": "FRET (Matayoshi et al., 1990 ) results demonstrate that the mutations reduced the catalytic activity to varying degrees ( Fig. 4 (E) and (F)). Only the N-finger deletion variant exhibited a complete loss of activity. The large buried surface area is responsible for dimer association of PEDV 3CL pro and one residue substitution may not completely destroy the dimerization. The N-finger residues of coronavirus 3CL pro are key components of the buried interface and are essential for dimerization. Thus, the N-finger deletion mutation destroyed the dimer form and inactivated PEDV 3CL pro .", "cite_spans": [{"start": 5, "end": 28, "text": "(Matayoshi et al., 1990", "ref_id": "BIBREF23"}], "ref_spans": [{"start": 122, "end": 128, "text": "Fig. 4", "ref_id": null}], "section": "The dimerization of PEDV 3CL pro"}, {"text": "In SARS-CoV 3CL pro , a hydrophobic interaction between the side chains of M6 and Y126 of the opposite promoter greatly contributes to the stabilization of the dimer conformation (Wei et al., 2006) . At the same time, the backbone oxygen of M6 and the Highest resolution values are written in parenthesis.", "cite_spans": [{"start": 179, "end": 197, "text": "(Wei et al., 2006)", "ref_id": "BIBREF43"}], "ref_spans": [], "section": "The dimerization of PEDV 3CL pro"}, {"text": "where is I i the intensity measurement of reflection h and o I 4is the average intensity from multiple observations. R work ¼Σ ||F o |À |F c ||/Σ |F o |; where F o and F c are the observed and calculated structure factors respectively. R free is equivalent to R work but where 5% of the measured reflections have been excluded from refinement and set aside for cross-validation.", "cite_spans": [], "ref_spans": [], "section": "The dimerization of PEDV 3CL pro"}, {"text": "The comparison of residue-residue interactions at the dimer interface from PEDV 3CL pro with these from other 3CL pro s.", "cite_spans": [], "ref_spans": [], "section": "Table 2"}, {"text": "The PDB identifiers for the four structures are 4XFQ, 1LVO, 2ZU2 and 1UK4. The hydrogen-bond and hydrophobic interactions are all analyzed in PyMOL (Schrödinger, 2006) . For the three Alphacoronavirus 3CL pro s, the residue-residue interactions are conserved except the two interactions (in purple bold) between domain III of each monomer. However, these two interactions are not observed in SARS-CoV 3CL pro , and the interaction between 298R and 123S is not found in the Alphacoronavirus 3CL pro s. nitrogen atom of the side chain NH2 of R298 in the same monomer form a hydrogen bond (2.94 Å), which can be further connected to the catalytic machinery of the opposite protomer through a two-step relay (Shi et al., 2008) . Thus, R298 is very important for the catalytic activity of SARS-CoV 3CL pro . As a result, the R298A mutation in the SARS-CoV 3CL pro caused a dimermonomer switch and inactivated the enzyme (Shi et al., 2008) . However, the homologous variant (R294A) in PEDV 3CL pro remained a dimer and an active enzyme ( Fig. 4 (E) and (F)). In the PEDV 3CL pro structure, R294 shows no interactions with any residues from another monomer. The result shows that R294 is not a key component involved in the dimerization of PEDV 3CL pro . Despite high sequence and structure similarities, differences in dimerization exist among 3CL pro s from different coronavirus genera. As in MERS-CoV 3CL pro , non-conserved residues far from the dimer interface might be involved in dimer formation of a weakly associated dimer (Tomar et al., 2015) . These structural differences may lead to differences in the dimerization and enzymatic properties of 3CL pro s from different coronavirus groups.", "cite_spans": [{"start": 148, "end": 167, "text": "(Schrödinger, 2006)", "ref_id": "BIBREF35"}, {"start": 704, "end": 722, "text": "(Shi et al., 2008)", "ref_id": "BIBREF32"}, {"start": 915, "end": 933, "text": "(Shi et al., 2008)", "ref_id": "BIBREF32"}, {"start": 1526, "end": 1546, "text": "(Tomar et al., 2015)", "ref_id": "BIBREF39"}], "ref_spans": [{"start": 1032, "end": 1038, "text": "Fig. 4", "ref_id": null}], "section": "Table 2"}, {"text": "2.3. Overall structure of the PEDV 3CL pro C144A variant in complex with the peptide substrate", "cite_spans": [], "ref_spans": [], "section": "Table 2"}, {"text": "In order to investigate further the substrate recognition mechanism of PEDV 3CL pro , we synthesized a peptide (TSAVLQ↓SGFRK) (Nanjing GenScript Company) for co-crystallization and determined the crystal structure of the C144A variant complex at 2.2 Å resolution in the space group, P2 1 . Two 3CL pro molecules are observed in the asymmetric unit, and the two monomers have the similar overall structures (RMSD of 0.25 Å for 186 superimposed Cα atoms of domain I and domain II, 0.92 Å for 99 superimposed Cα atoms of domain III). However, the first two domains show low RMSD values, it seems that they are more stable than the C-terminal helix domain. An eight amino acid peptide (SAVLQ↓SGF) is observed in only one monomer according to the density map (Fig. 5) , but the substrate-binding sites of the two monomers are almost identical. The first two domains show almost no differences and domain III shows slight structure deviation. However, the substrate lies in the cleft between the first two domains. Thus, the absence of the peptide in another monomer may be caused by the poor density map or the crystal package. The four residues P4-P1 form an antiparallel β sheet with residues 162-166, and residues P5-P4 form an antiparallel β sheet on the other side with residues 188-190 of the long loop A, that links domain II and III (Fig. 5(A) ). The P1′ to P3′ strand extends into the solvent, and P2′-G forms a short antiparallel strand interaction with A26.", "cite_spans": [], "ref_spans": [{"start": 754, "end": 762, "text": "(Fig. 5)", "ref_id": "FIGREF2"}, {"start": 1336, "end": 1346, "text": "(Fig. 5(A)", "ref_id": "FIGREF2"}], "section": "Table 2"}, {"text": "Coronavirus 3CL pro recognizes a conserved residue (glutamine) at the P1 position for efficient hydrolysis Ziebuhr and Siddell, 1999; Ziebuhr et al., 2000) . The side chain of the The residues of interface A and interface B are colored in pink and olive green, respectively. The carbon, nitrogen, and oxygen atoms are shown as black, blue and red circles, respectively. Hydrogen bonds are shown as black dashed lines labeled with the distance between the donor and corresponding acceptor atom. Hydrophobic interactions are demonstrated by arcs with spokes radiating toward the atoms (with spokes around) or residues (shown as arcs with spokes) they contact. B. Another interacting patch at the interface that is important for dimerization. Fig. 4 . Mutational studies of several residues at the dimer interface. A. Size exclusion chromatography (SEC) analyses of the four site variants and the N-terminal-deletion variant (Δ8aa). WT, Δ8aa, Q295A, R294A, S138A and R4A are shown in red, black, orange, blue, yellow and green, respectively. B. Calibration curve. Conalbumin, 75 kDa; carbonic anhydrase, 29 kDa; equine myoglobin, 17 kDa; ribonuclease A, 13.7 kDa; aprotinin, 6.5 kDa; vitamin B12, 1.35 kDa (Bio-Rad and GE Healthcare) were used to calibrate the column. The values of the Y-axis were calculated using the equation K av ¼(V e À V 0 )/(Vt À V 0 ). C. Sedimentation velocity analysis of the WT and variants. The major peak for each sample represents the major state of the protease. D. Calculated molecular masses based on the results of SEC and AUC assays, respectively. Δ8aa primarily exists as monomers. E. FRET-based mutational studies of the residues that may be involved in the dimerization of PEDV 3CL pro . The S138A, R4A, and Q295A variants exhibited reduced catalytic activity to various degrees (1, 0.74, 0.94, 1.22, 0.66, and 0.09, respectively; the activity of wild type PEDV 3CL pro was taken as 1). None of the three variants caused a great or complete loss of activity, and the catalytic activity of the R294A variant exhibited no reduction. Only the N-finger deletion variant exhibited a complete loss of activity. F. Same as that in panel E but with different substrate concentration.", "cite_spans": [{"start": 107, "end": 133, "text": "Ziebuhr and Siddell, 1999;", "ref_id": "BIBREF49"}, {"start": 134, "end": 155, "text": "Ziebuhr et al., 2000)", "ref_id": "BIBREF48"}], "ref_spans": [{"start": 740, "end": 746, "text": "Fig. 4", "ref_id": null}], "section": "Details of the substrate-binding sites of PEDV 3CL pro"}, {"text": "conserved P1-Q fits comfortably in the pocket (Fig. 5(A) ), stabilized by two hydrogen bonds: one between the Nε2 atom of H162 and the Oε1 atom of P1-Q and another between the side chain oxygen of E165 and the Nε2 atom of P1-Q (Fig. 5(B) ). The main chain amides of G142 and A144 form an oxyanion hole that stabilizes the carbonyl oxygen of P1-Q. The main chain nitrogen atom of P1-Q forms a hydrogen bond with the main chain oxygen of Q163. The S2 sub-site of PEDV 3CL pro consists of P188, L164, I51, S46 and H41, similar to that of TGEV 3CL pro , which is lined with the side chains of P188, L164, I51, T47 and H41 (Anand et al., 2002) . The side chains of these residues form a hydrophobic pocket that can accommodate a P2 residue with a large side chain, such as leucine or methionine (Fig. 5(A) ). The main chain of P3-V forms two hydrogen bonds with the main chain of E165, and the side chain of P3-V is exposed to the solvent (Fig. 5(A) ). Since the side chain of P3 Val is pointing to the surface and therefore to the solvent, the charged character of the P3 residue has no difference or preference. The P4 pocket consists of a series of hydrophobic amino acids and may prefer residues with high hydrophobicity. A hydrogen bond is found between the main chain NH of P4-A and the carbonyl oxygen of T189. The PEDV 3CL pro S1′ sub-site is composed of M25, A26, L27, C38, P39, H41 and V42. Small residues such as serine, glycine and alanine are preferred in the small S1′ pocket. The main chain of P2′-G forms two hydrogen bonds with the main chain atoms of A26 (Fig. 5(B) ). Due to the poor density of P3′-F, its carbonyl group and the side chain phenyl group could easily be interchanged during structure refinement. The conservation in the substrate binding pockets provides a basic model for the design of potential antiviral agents (Yang et al., 2005) . In the PEDV 3CL pro structure, the imidazole ring of H41 forms an abnormal conformation due to the low crystallization pH. However, in the complex structure of the active-site variant (C144A), the H41 imidazole ring is recovered (Fig. S1 ). The entire imidazole ring lies parallel with the side chain of P2-L and interacts through hydrophobic effects, and the Nε2 of 41 h becomes closer (3.3 Å) to the peptide bond between P1-Gln and P1′-Ser.", "cite_spans": [{"start": 618, "end": 638, "text": "(Anand et al., 2002)", "ref_id": "BIBREF2"}, {"start": 1843, "end": 1862, "text": "(Yang et al., 2005)", "ref_id": "BIBREF46"}], "ref_spans": [{"start": 46, "end": 56, "text": "(Fig. 5(A)", "ref_id": "FIGREF2"}, {"start": 227, "end": 237, "text": "(Fig. 5(B)", "ref_id": "FIGREF2"}, {"start": 790, "end": 800, "text": "(Fig. 5(A)", "ref_id": "FIGREF2"}, {"start": 934, "end": 944, "text": "(Fig. 5(A)", "ref_id": "FIGREF2"}, {"start": 1568, "end": 1578, "text": "(Fig. 5(B)", "ref_id": "FIGREF2"}, {"start": 2094, "end": 2102, "text": "(Fig. S1", "ref_id": null}], "section": "Details of the substrate-binding sites of PEDV 3CL pro"}, {"text": "Part of the detailed interaction network is shown in Fig. 6(A) . A water molecule is hydrogen-bonded to three residues (H41, Q163 and D186). Notably, the buried water molecule takes the place that is normally occupied by the side chain of D102 in the catalytic triad of the chymotrypsin and other members of this serine protease family. The oxyanion hole that stabilizes the main chain oxygen of P1-Q is made up of the main chain amides of G142 and A144. To determine whether the residues around the catalytic dyad are essential for hydrolytic activity, we performed proteolytic activity analyses of the variants (H41A, C144A, C144S, H162A and D186A). The results demonstrate that the fluorescence values of WT PEDV 3CL pro increase in a time-dependent manner, whereas none of the variants exhibit enzymatic activity (Fig. 6(B) ). This finding indicates that the catalytic dyad of PEDV 3CL pro is essential for its proteolytic activity. Additionally, H162 and D186 in the substrate binding site are both essential, which are conserved among coronavirus 3CL pro s ( Fig. 1(B) ).", "cite_spans": [], "ref_spans": [{"start": 53, "end": 62, "text": "Fig. 6(A)", "ref_id": null}, {"start": 817, "end": 827, "text": "(Fig. 6(B)", "ref_id": null}, {"start": 1065, "end": 1074, "text": "Fig. 1(B)", "ref_id": null}], "section": "Details of the substrate-binding sites of PEDV 3CL pro"}, {"text": "A His-tag was added to the C-terminus during construction. Unfortunately, we could not see the spatial orientation of the tag due to the poor density map. The WT-Δ3aa variant without a Histag was also constructed, and the protease performed similar enzymatic activity to that of the WT-Δ3aa-His variant (data not shown). Therefore, the tag may not cause major effect on both the activity and on the conformation of the enzyme.", "cite_spans": [], "ref_spans": [], "section": "Details of the substrate-binding sites of PEDV 3CL pro"}, {"text": "In general, Coronavirus 3CL pro s recognize a conserved cleavage site. To determine whether the two proteases from the first two coronavirus genera have differences in substrate specificities, two fluorogenic peptide substrates (Dabcyl-KTSAVLQ↓SGFRKME-Edans and Dabcyl-YNSTLQ↓AGLRKME-Edans contain the N-terminal auto-cleavage sites of PEDV and SARS-CoV 3CL pro s, respectively) were introduced in the FRET assays. In addition to processing viral polyproteins, coronavirus 3CL pro has the potential to cleave host proteins during virus-host interactions. PEDV 3CL pro regulates its interferon antagonism by cleaving nuclear transcription factor- Three-dimensional structure of the substrate-binding pockets with a peptide. The residues of the pockets are represented in green as a stick diagram, and the substrate is shown in yellow as a stick diagram. The S1, S2, S4 and S1′ pockets are labeled. The residues are all labeled. The nitrogen atoms are shown in blue, and oxygen atoms are shown in red. Hydrogen bond interactions are shown as black dashed lines. B. Diagram of the detailed molecular interactions between the substrate and the protease. The peptide substrate is shown in brown. Hydrogen bonds are shown as blue dashed lines, and the hydrogens were connected to their acceptors by the dashed lines. The distances labeled reflect the distances between the donor and the acceptor for all hydrogen bonds. Ceratina electron density map of the peptide substrate (2Fo-Fc, contoured at 1.0 s). kappaB (NF-κB) essential modulator (NEMO) (Wang et al., 2016) . The third fluorogenic peptide substrate (Dabcyl-KLAQLQ↓VAYHQE-Edans), which contains the cleavage site derived from NEMO was also applied in the cleavage assays. Both the proteases are able to cleave the two 3CL pro substrates and prefer the SARS-CoV 3CL pro -derived substrate; however PEDV 3CL pro demonstrates better hydrolysis efficiency than SARS-CoV 3CL pro (Fig. 7(A) ). Surprisingly, SARS-CoV 3CL pro is unable to cleave the NEMO-derived substrate, whereas PEDV 3CL pro shows efficient hydrolysis (Fig. 7  (B) ). Similar results were obtained when the concentration of the proteases increased by 10-fold (data not shown).", "cite_spans": [{"start": 1541, "end": 1560, "text": "(Wang et al., 2016)", "ref_id": "BIBREF42"}], "ref_spans": [{"start": 1927, "end": 1937, "text": "(Fig. 7(A)", "ref_id": "FIGREF3"}, {"start": 2068, "end": 2080, "text": "(Fig. 7  (B)", "ref_id": "FIGREF3"}], "section": "None-conserved motifs cause differences in substrate specificity"}, {"text": "To understand the inability of SARS-CoV 3CL pro to cleave the NEMO-derived substrate, we analyzed its substrate preference at each sub-site according to the previous study. Each residue of \"KLAQLQ↓VAYHQE\" is preferred at the corresponding sub-sites of SARS-CoV 3CL pro , with the exception of the P1′-V, which prefers small residues with side chain volumes of less than 50 Å 3 (Ser; Ala; Cys) at the S1′ sub-site (Chuck et al., 2010; Chuck et al., 2011) . The PEDV 3CL pro S1′ sub-site is composed of M25, A26, L27, C38, P39, H41 and V42, and those of SARS-CoV 3CL pro are T25, T26, L27, C38, P39, H41 and V42. The hydrophobic side chain of M25 may form hydrophobic interactions with the side chain of P1′-V, which may lead to the tolerance of P1′-V of PEDV 3CL pro . To verify the hypothesis, we replaced the whole motif with that of SARS-CoV Fig. 6 . Key residues for enzyme catalytic activity. A. A structural diagram of several key residues involved in enzyme catalytic activity. The residues of the protease are colored yellow, and the substrate is colored magenta. The residues of the substrate are labeled and shown as stick diagrams. Hydrogen bond interactions are shown as dashed lines, along with the bond distance. A water molecule buried by three residues (H41, Q163 and D186) is shown as a blue sphere. The oxyanion hole region is shown as a subtransparent blue oval. B. Fluorescence profiles of the hydrolysis of the fluorogenic substrate by WT-Δ3aa-His and the variants of PEDV 3CL pro . The enhanced fluorescence intensity was monitored for 60 min. All five site-directed variants showed nearly no activity compared with WT-Δ3aa-His. Two fluorogenic peptide substrates (Dabcyl-KTSAVLQ↓SGFRKME-Edans and Dabcyl-YNSTLQ↓AGLRKME-Edans contain the N-terminal auto-cleavage site of PEDV and SARS-CoV 3CL pro , respectively) were introduced in the FRET assays. (□: SARS-CoV 3CL pro -derived substrate cleaved by PEDV 3CL pro ; ○: PEDV 3CL pro -derived substrate cleaved by PEDV 3CL pro ; Δ: SARS-CoV 3CL pro -derived substrate cleaved by SARS-CoV 3CL pro ; ∇: PEDV 3CL pro -derived substrate cleaved by SARS-CoV 3CL pro ). B. Cleavage of NEMO-derived substrate. Similar results were obtained when the concentration of the proteases increased by 10-folds (data not shown). Four proteases used in each assay were labeled in the figure. Motif-mutant and M25T represent two PEDV 3CL pro variants described in the text. Same concentration of the NEMO-derived substrate was used for the four proteases. 3CL pro (\"RVCYGNMA\"19-26\"QVTCGTTT\" ) and also performed the point mutation M25T. It was confirmed that both the variants performed obvious cleavage of the SARS-CoV 3CL pro -derived substrate (data not shown); however, they failed to cleave the NEMOderived substrate (Fig. 7(B) ). It indicates that the motif (19-26), especially the M25 residue, is important for the cleavage of the NEMO-derived substrate by PEDV 3CL pro . And PEDV 3CL pro appears to bear residues with larger side chains at the S1′ sub-site than SARS-CoV 3CL pro does.", "cite_spans": [{"start": 413, "end": 433, "text": "(Chuck et al., 2010;", "ref_id": "BIBREF4"}, {"start": 434, "end": 453, "text": "Chuck et al., 2011)", "ref_id": "BIBREF5"}], "ref_spans": [{"start": 844, "end": 850, "text": "Fig. 6", "ref_id": null}, {"start": 2772, "end": 2782, "text": "(Fig. 7(B)", "ref_id": "FIGREF3"}], "section": "None-conserved motifs cause differences in substrate specificity"}, {"text": "The conserved residues of the sub-sites result in relatively conserved substrate specificity of coronavirus 3CL pro s. However, the non-conserved motifs of the pockets may also influence the recognition of the substrate. Except for the motif 1 (residues 22-26) mentioned above, three more motifs are found partly different between PEDV and SARS-CoV 3CL pro s (PDB identifier 2Q6G) (Fig. 8) . In motif 1, the two residues (N24 and M25) of PEDV 3CL pro carry different side chains than those (T24 and T25) of SARS-CoV 3CL pro , which result in differences in the pockets mouth ( Fig. 8 (C) and (D)). Motif 2 of the two proteases consists of partly different residues. In motif 3, the aspartic acid side chains exhibit opposite orientations, which also result in differences in the pocket mouths. The residues of motif 4 obviously differ between the two proteases; they exhibit nearly no sequence homology (Fig. 8(B) ), and the SARS-CoV 3CL pro motif 4 contains two negatively charged residues (E47 and D48) (Fig. 8(B) and (C)). We further analyzed the four motifs sequences between Alphacoronavirus and Betacoronavirus 3CL pro s ( Fig. 8(B) ). The four motifs are relatively well conserved in Alphacoronavirus 3CL pro s and differ from those of Betacoronavirus. These differences may also lead to the different sizes or depths of the pockets, thus causing the differences in recognition of the substrates.", "cite_spans": [], "ref_spans": [{"start": 381, "end": 389, "text": "(Fig. 8)", "ref_id": null}, {"start": 577, "end": 583, "text": "Fig. 8", "ref_id": null}, {"start": 903, "end": 913, "text": "(Fig. 8(B)", "ref_id": null}, {"start": 1005, "end": 1015, "text": "(Fig. 8(B)", "ref_id": null}, {"start": 1129, "end": 1138, "text": "Fig. 8(B)", "ref_id": null}], "section": "None-conserved motifs cause differences in substrate specificity"}, {"text": "In summary, we have determined the crystal structure of PEDV 3CL pro alone and in complex with a peptide substrate that contains the N-terminal cleavage site. The strategy for mimicking the peptide substrate side chains to accommodate the corresponding sub-sites can be utilized to design inhibitors (Yang et al., 2005) . Thus, our structures may provide the basis for the design of inhibitors against PEDV 3CL pro . The biochemical and structural analyses revealed that PEDV 3CL pro forms a tight dimer, and no variants caused a dimer-tomonomer switch except the N-finger deletion variant. The interaction networks involved in dimer formation of 3CL pro are relatively well conserved among Alphacoronavirus but somewhat different from those of SARS-CoV 3CL pro in Betacoronavirus. Finally, we find that non-conserved motifs in the pockets cause different cleavage of Fig. 8 . Comparison of the potential substrate-binding motifs of the PEDV and SARS-CoV 3CL pro s. A. A cartoon view of the four motifs around the substrate. The PEDV 3CL pro complex structure (magenta) is superimposed with the complex structure of the SARS-CoV 3CL pro variant (C144A) (PDB identifier 2Q6G) (green). The peptide substrate is colored blue. The four motifs and some residues shown as stick diagrams are labeled. B. Sequence alignment of the four motifs of 3CL pro s of the three coronavirus groups. The residues that are relatively conserved in Alphacoronavirus 3CL pro but differ from those of Betacoronavirus 3CL pro are marked with pink vertical lines. C. Electrostatic surface potential of the PEDV 3CL pro complex structure. The four motifs are shown as a magenta cartoon and the substrate is shown as blue sticks. Three residues shown as stick diagrams are labeled. D. Electrostatic surface potential of the SARS-CoV 3CL pro complex structure. The four motifs are shown as a green cartoon and the substrate is shown as blue sticks. Three residues shown as stick diagrams are labeled, and the negatively charged area (red) of motif4 is labeled. substrate between the PEDV and SARS-CoV 3CL pro s; we further analyzed the differences of the motifs between 3CL pro s from Alphacoronavirus and Betacoronavirus.", "cite_spans": [{"start": 300, "end": 319, "text": "(Yang et al., 2005)", "ref_id": "BIBREF46"}], "ref_spans": [{"start": 868, "end": 874, "text": "Fig. 8", "ref_id": null}], "section": "Conclusion"}, {"text": "The PEDV nsp5 (encoding 3CL pro ) gene was cloned from the viral cDNA of the FJZZ strain (GenBank: KC140102.1) via PCR. The forward and reverse primers contained NdeI and XhoI restriction sites, respectively. The PCR product contained a C-terminal His-tag for further protein purification. The PCR product was cloned into the pET42b expression vector. Multiple truncation recombinant plasmids and variants were also constructed. NcoI and XhoI restriction sites were used for the pET28a vector. BamHI and XhoI restriction sites were used for the pET28a-sumo vector. The recombinant WT-Δ3aa-His (the last three amino acids, NLQ, were deleted, and a His-tag was added to the C-terminus) plasmid was used as a template for the following variants: M25T, H41A, H162A, C144A, C144S, D186A and the motif variant. The recombinant Hissumo-WT (a His-sumo fusion tag was added to the N-terminus) plasmid was used as a template for the following site mutations: R4A, S138A, R294A and Q295A. Then, overlap-extension PCR was performed (Ho et al., 1989) . All of the recombinant expression plasmids were sequenced, and no unexpected mutations occurred.", "cite_spans": [{"start": 1020, "end": 1037, "text": "(Ho et al., 1989)", "ref_id": "BIBREF15"}], "ref_spans": [], "section": "Cloning, protein expression and purification"}, {"text": "For protein expression, the recombinant plasmids were transformed into E. coli BL21 (DE3) and then cultured at 37°C in LB medium until the OD600 reached 0.6-0.8. Then, 1 mM isopropylβ-D-thiogalactopyranoside (IPTG) was added to induce protein expression. The cells were harvested after incubation at 27°C for 7 h, resuspended in PBS and disrupted (ATS AH-1500). The supernatant was filtered and loaded onto a His Trap™ HP column (GE Healthcare), and the C-terminal His-tagged protein was finally eluted using a linear gradient between the binding buffer and elution buffer A (20 mM Tris, pH 7.4, 500 mM NaCl, and 500 mM imidazole), followed by another 30 ml of 100% elution buffer A. The target protein was further purified by a 120 ml Superdex 200 (GE Healthcare) column with elution buffer B (20 mM Tris, pH 7.4, 200 mM NaCl). The N-terminal His-sumo-tagged protease was digested with sumo protease to remove the tag and then loaded onto a 120 ml Superdex 200 column. The proteins were again eluted with elution buffer B and concentrated after SDS-PAGE analysis. All of the purification procedures were performed at 4°C to avoid unexpected degradation.", "cite_spans": [], "ref_spans": [], "section": "Cloning, protein expression and purification"}, {"text": "PEDV 3CL pro was crystallized via the sitting drop vapor diffusion method at 20°C. The best crystals were produced under the following conditions: 0.1 M NaCl, 0.2 M Na 2 HPO 4 : citric acid (pH 4.2) and 5% (w/v) PEG 3350. PEDV 3CL pro variant (C144A) crystals were obtained under the same conditions. The 11-amino-acid peptide substrate (TSAVLQ↓SGFRK, that contains the N-terminal auto-cleavage site of SARS-CoV 3CL pro ) was dissolved at a 20 mM in elution buffer B as a stock solution. For crystal soaking, the solution was diluted to 10 mM and then added to the variant (C144A) crystallization drop at an equal volume. The crystals were soaked for 14 h before data collection. The single crystals were first washed with 5%, 10%, 15%, and 30% ethylene glycol (v/v) as a cryoprotectant and then flash-frozen in liquid nitrogen. All data collection was performed at beamline BL17U at the Shanghai Synchrotron Radiation Facility (SSRF) using a MAR 225 CCD detector (MAR Research). All of the obtained data sets were indexed, integrated and scaled using HKL-3000 (Otwinowski and Minor, 1997). The structure was solved by molecular replacement with PHASER (Mccoy et al., 2007) using the structure of human coronavirus 229E 3CL pro (PDB identifier 1P9S) as a starting model. The structure of the complex was determined via molecular replacement using the previously determined PEDV 3CL pro structure as the search model. Manual model building was performed using Coot (Emsley and Cowtan, 2004) , and the structure was refined with Phenix (Adams et al., 2002) . Refinement statistics are shown in Table 1 . All of the structural figures were drawn using PyMOL (Schrödinger, 2006) .", "cite_spans": [{"start": 1153, "end": 1173, "text": "(Mccoy et al., 2007)", "ref_id": "BIBREF24"}, {"start": 1464, "end": 1489, "text": "(Emsley and Cowtan, 2004)", "ref_id": "BIBREF10"}, {"start": 1534, "end": 1554, "text": "(Adams et al., 2002)", "ref_id": "BIBREF1"}, {"start": 1655, "end": 1674, "text": "(Schrödinger, 2006)", "ref_id": "BIBREF35"}], "ref_spans": [{"start": 1592, "end": 1599, "text": "Table 1", "ref_id": "TABREF0"}], "section": "Crystallization and structure determination"}, {"text": "Based on the N-terminal cleavage site of PEDV 3CL pro , we designed the peptide substrate Dabcyl-YNSTLQ↓AGLRKM-E-Edans (Nanjing GenScript Company). The two fluorophores formed a quenching pair and exhibited fluorescence resonance energy transfer (FRET) within the peptide (Matayoshi et al., 1990) . The increase in fluorescence upon cleavage of the fluorogenic peptide substrate was monitored every minute for 1 h at 485 nm, with excitation at 340 nm, using a fluorescence plate reader (Kuo et al., 2004) . The WT-Δ3aa-His protein was used in the assays. All reactions were performed in 20 mM HEPES, 50 mM NaCl, 0.4 mM EDTA, 30% glycerol and 4 mM DTT at pH 8.0 in a total volume of 100 μl. The enzyme concentration used in the FRET assay was 200 nM, and the substrate concentration was 0-200 μM. The initial rates were used to calculate the kinetic parameters by fitting with the Michaelis-Menten equation using GraphPad Prism5. For the variants, all of the assay conditions were identical, but the assays were performed at a fixed substrate concentration.", "cite_spans": [{"start": 272, "end": 296, "text": "(Matayoshi et al., 1990)", "ref_id": "BIBREF23"}, {"start": 486, "end": 504, "text": "(Kuo et al., 2004)", "ref_id": "BIBREF17"}], "ref_spans": [], "section": "FRET-based assays for enzymatic characteristics"}, {"text": "The residue-residue interactions at the dimer interface of PEDV 3CL pro are listed in Table 2 . Four variants (R4A, S138A, R294A and Q295A) and an N-finger deletion variant (Δ8aa) were selected for oligomeric state analysis. All of the mutated proteins were stored in elution buffer B at À80°C. A Superdex 75 10/300 GL column (GE Healthcare) was used for the analysis of the WT and protein variants. The column was equilibrated with elution buffer B (20 mM Tris, pH 7.4, and 200 mM NaCl), and 250 μg of protein was then loaded onto the column and eluted with elution buffer B. Equal volumes of size exclusion standards (Conalbumin, 75 kDa; carbonic anhydrase, 29 kDa; equine myoglobin, 17 kDa; ribonuclease A, 13.7 kDa; aprotinin, 6.5 kDa; vitamin B12, 1.35 kDa) (Bio-Rad and GE Healthcare) were used to calibrate the column. The 280 nm absorbance peaks were generated and overlaid using Bio-Rad NGC software.", "cite_spans": [], "ref_spans": [{"start": 86, "end": 93, "text": "Table 2", "ref_id": null}], "section": "Size-exclusion chromatography (SEC) and analytical ultracentrifugation (AUC) analysis"}, {"text": "To further confirm the oligomeric state and determine the effect of the variants on the monomer-dimer equilibrium of PEDV 3CL pro , sedimentation velocity experiments were conducted at 18°C on the XL-A instrument (Beckman) at 50,000 rpm. Proteins were prepared at the concentration of approximately 0.9 mg/ml in elution buffer B. The sedimentation boundary was monitored every 3 min for a total of 110 scans using the absorbance optics of 280 nm. The software Sedfit was used to fit the data to a distribution of Lamm equation solutions c(s) model (Schuck, 2000) .", "cite_spans": [{"start": 548, "end": 562, "text": "(Schuck, 2000)", "ref_id": "BIBREF34"}], "ref_spans": [], "section": "Size-exclusion chromatography (SEC) and analytical ultracentrifugation (AUC) analysis"}, {"text": "Coordinate and structure factors have been submitted to the PDB (accession numbers 4XFQ and 4ZUH).", "cite_spans": [], "ref_spans": [], "section": "Accession numbers"}], "bib_entries": {"BIBREF0": {"ref_id": "b0", "title": "Ratification vote on taxonomic proposals to the international committee on taxonomy of viruses", "authors": [{"first": "M", "middle": ["J"], "last": "Adams", "suffix": ""}, {"first": "E", "middle": ["B"], "last": "Carstens", "suffix": ""}], "year": 2012, "venue": "Arch. Virol", "volume": "157", "issn": "", "pages": "1411--1422", "other_ids": {}}, "BIBREF1": {"ref_id": "b1", "title": "PHENIX: building new software for automated crystallographic structure determination", "authors": [{"first": "P", "middle": ["D"], "last": "Adams", "suffix": ""}, {"first": "R", "middle": ["W"], "last": "Grosse-Kunstleve", "suffix": ""}, {"first": "L", "middle": ["W"], "last": "Hung", "suffix": ""}, {"first": "T", "middle": ["R"], "last": "Ioerger", "suffix": ""}, {"first": "A", "middle": ["J"], "last": "Mccoy", "suffix": ""}, {"first": "N", "middle": ["W"], "last": "Moriarty", "suffix": ""}, {"first": "R", "middle": ["J"], "last": "Read", "suffix": ""}, {"first": "J", "middle": ["C"], "last": "Sacchettini", "suffix": ""}, {"first": "N", "middle": ["K"], "last": "Sauter", "suffix": ""}, {"first": "T", "middle": ["C"], "last": "Terwilliger", "suffix": ""}], "year": 2002, "venue": "Acta Crystallogr. D Biol. Crystallogr", "volume": "58", "issn": "", "pages": "1948--1954", "other_ids": {}}, "BIBREF2": {"ref_id": "b2", "title": "Structure of coronavirus main proteinase reveals combination of a chymotrypsin fold with an extra α-helical domain", "authors": [{"first": "K", "middle": [], "last": "Anand", "suffix": ""}, {"first": "G", "middle": ["J"], "last": "Palm", "suffix": ""}, {"first": "J", "middle": ["R"], "last": "Mesters", "suffix": ""}, {"first": "S", "middle": ["G"], "last": "Siddell", "suffix": ""}, {"first": "J", "middle": [], "last": "Ziebuhr", "suffix": ""}, {"first": "R", "middle": [], "last": "Hilgenfeld", "suffix": ""}], "year": 2002, "venue": "EMBO J", "volume": "21", "issn": "", "pages": "3213--3224", "other_ids": {}}, "BIBREF3": {"ref_id": "b3", "title": "Coronavirus main proteinase (3CL pro ) structure: basis for design of anti-SARS drugs", "authors": [{"first": "K", "middle": [], "last": "Anand", "suffix": ""}, {"first": "J", "middle": [], "last": "Ziebuhr", "suffix": ""}, {"first": "P", "middle": [], "last": "Wadhwani", "suffix": ""}, {"first": "J", "middle": ["R"], "last": "Mesters", "suffix": ""}, {"first": "R", "middle": [], "last": "Hilgenfeld", "suffix": ""}], "year": 2003, "venue": "Science", "volume": "300", "issn": "", "pages": "1763--1767", "other_ids": {}}, "BIBREF4": {"ref_id": "b4", "title": "Profiling of substrate specificity of SARS-CoV 3CL", "authors": [{"first": "C", "middle": ["P"], "last": "Chuck", "suffix": ""}, {"first": "L", "middle": ["T"], "last": "Chong", "suffix": ""}, {"first": "C", "middle": [], "last": "Chen", "suffix": ""}, {"first": "H", "middle": ["F"], "last": "Chow", "suffix": ""}, {"first": "D", "middle": ["C"], "last": "Wan", "suffix": ""}, {"first": "K", "middle": ["B"], "last": "Wong", "suffix": ""}], "year": 2010, "venue": "Plos One", "volume": "5", "issn": "", "pages": "", "other_ids": {}}, "BIBREF5": {"ref_id": "b5", "title": "Profiling of substrate specificities of 3C-like proteases from group 1, 2a, 2b, and 3 coronaviruses", "authors": [{"first": "C", "middle": ["P"], "last": "Chuck", "suffix": ""}, {"first": "H", "middle": ["F"], "last": "Chow", "suffix": ""}, {"first": "D", "middle": ["C"], "last": "Wan", "suffix": ""}, {"first": "K", "middle": ["B"], "last": "Wong", "suffix": ""}], "year": 2011, "venue": "Plos One", "volume": "6", "issn": "", "pages": "", "other_ids": {}}, "BIBREF6": {"ref_id": "b6", "title": "An inactivated vaccine made from a U.S. field isolate of porcine epidemic disease virus is immunogenic in pigs as demonstrated by a dose-titration", "authors": [{"first": "E", "middle": ["A"], "last": "Collin", "suffix": ""}, {"first": "S", "middle": [], "last": "Anbalagan", "suffix": ""}, {"first": "F", "middle": [], "last": "Okda", "suffix": ""}, {"first": "R", "middle": [], "last": "Batman", "suffix": ""}, {"first": "E", "middle": [], "last": "Nelson", "suffix": ""}, {"first": "B", "middle": ["M"], "last": "Hause", "suffix": ""}], "year": 2015, "venue": "BMC Vet. Res", "volume": "11", "issn": "", "pages": "", "other_ids": {}}, "BIBREF7": {"ref_id": "b7", "title": "The emerging novel Middle East respiratory syndrome coronavirus: the \"knowns\" and \"unknowns", "authors": [{"first": "J", "middle": ["F W"], "last": "Chan", "suffix": ""}, {"first": "S", "middle": ["K P"], "last": "Lau", "suffix": ""}, {"first": "P", "middle": ["C Y"], "last": "Woo", "suffix": ""}], "year": 2013, "venue": "J. Formos. Med. Assoc", "volume": "112", "issn": "", "pages": "372--381", "other_ids": {}}, "BIBREF8": {"ref_id": "b8", "title": "Residues on the dimer interface of SARS coronavirus 3C-like protease: dimer stability characterization and enzyme catalytic activity analysis", "authors": [{"first": "S", "middle": [], "last": "Chen", "suffix": ""}, {"first": "J", "middle": [], "last": "Zhang", "suffix": ""}, {"first": "T", "middle": [], "last": "Hu", "suffix": ""}, {"first": "K", "middle": [], "last": "Chen", "suffix": ""}, {"first": "H", "middle": [], "last": "Jiang", "suffix": ""}, {"first": "X", "middle": [], "last": "Shen", "suffix": ""}], "year": 2008, "venue": "J. Biochem", "volume": "143", "issn": "", "pages": "525--536", "other_ids": {}}, "BIBREF9": {"ref_id": "b9", "title": "Family Coronaviridae", "authors": [{"first": "R", "middle": ["J"], "last": "De Groot", "suffix": ""}, {"first": "S", "middle": ["C"], "last": "Baker", "suffix": ""}, {"first": "R", "middle": [], "last": "Baric", "suffix": ""}, {"first": "L", "middle": [], "last": "Enjuanes", "suffix": ""}, {"first": "A", "middle": ["E"], "last": "Gorbalenya", "suffix": ""}, {"first": "K", "middle": ["V"], "last": "Holmes", "suffix": ""}, {"first": "S", "middle": [], "last": "Perlman", "suffix": ""}, {"first": "L", "middle": [], "last": "Poon", "suffix": ""}, {"first": "P", "middle": ["J M"], "last": "Rottier", "suffix": ""}, {"first": "P", "middle": ["J"], "last": "Talbot", "suffix": ""}, {"first": "P", "middle": ["C Y"], "last": "Woo", "suffix": ""}, {"first": "J", "middle": [], "last": "Ziebuhr", "suffix": ""}], "year": 2012, "venue": "Ninth Report of the International Committee on Taxonomy of Viruses", "volume": "", "issn": "", "pages": "806--828", "other_ids": {}}, "BIBREF10": {"ref_id": "b10", "title": "Coot: model-building tools for molecular graphics", "authors": [{"first": "P", "middle": [], "last": "Emsley", "suffix": ""}, {"first": "K", "middle": [], "last": "Cowtan", "suffix": ""}], "year": 2004, "venue": "Acta Crystallogr. D Biol. Crystallogr", "volume": "60", "issn": "", "pages": "2126--2132", "other_ids": {}}, "BIBREF11": {"ref_id": "b11", "title": "Transmissible gastroenteritis", "authors": [{"first": "D", "middle": ["J"], "last": "Garwes", "suffix": ""}], "year": 1988, "venue": "Vet. Rec", "volume": "122", "issn": "", "pages": "462--463", "other_ids": {}}, "BIBREF12": {"ref_id": "b12", "title": "Mutational analysis of the active centre of coronavirus 3C-like proteases", "authors": [{"first": "A", "middle": [], "last": "Hegyi", "suffix": ""}, {"first": "A", "middle": [], "last": "Friebe", "suffix": ""}, {"first": "A", "middle": ["E"], "last": "Gorbalenya", "suffix": ""}, {"first": "J", "middle": [], "last": "Ziebuhr", "suffix": ""}], "year": 2002, "venue": "J. Gen. Virol", "volume": "83", "issn": "", "pages": "581--593", "other_ids": {}}, "BIBREF13": {"ref_id": "b13", "title": "Conservation of substrate specificities among coronavirus main proteases", "authors": [{"first": "A", "middle": [], "last": "Hegyi", "suffix": ""}, {"first": "J", "middle": [], "last": "Ziebuhr", "suffix": ""}], "year": 2002, "venue": "J. Gen. Virol", "volume": "83", "issn": "", "pages": "595--599", "other_ids": {}}, "BIBREF14": {"ref_id": "b14", "title": "From SARS to MERS: crystallographic studies on coronaviral proteases enable antiviral drug design", "authors": [{"first": "R", "middle": [], "last": "Hilgenfeld", "suffix": ""}], "year": 2014, "venue": "FEBS J", "volume": "281", "issn": "", "pages": "4085--4096", "other_ids": {}}, "BIBREF15": {"ref_id": "b15", "title": "Site-directed mutagenesis by overlap extension using the polymerase chain reaction", "authors": [{"first": "S", "middle": ["N"], "last": "Ho", "suffix": ""}, {"first": "H", "middle": ["D"], "last": "Hunt", "suffix": ""}, {"first": "R", "middle": ["M"], "last": "Horton", "suffix": ""}, {"first": "J", "middle": ["K"], "last": "Pullen", "suffix": ""}, {"first": "L", "middle": ["R"], "last": "Pease", "suffix": ""}], "year": 1989, "venue": "Gene", "volume": "77", "issn": "", "pages": "51--59", "other_ids": {}}, "BIBREF16": {"ref_id": "b16", "title": "Critical assessment of important regions in the subunit association and catalytic action of the severe acute respiratory syndrome coronavirus main protease", "authors": [{"first": "W.-C", "middle": [], "last": "Hsu", "suffix": ""}, {"first": "H.-C", "middle": [], "last": "Chang", "suffix": ""}, {"first": "C.-Y", "middle": [], "last": "Chou", "suffix": ""}, {"first": "P.-J", "middle": [], "last": "Tsai", "suffix": ""}, {"first": "P.-I", "middle": [], "last": "Lin", "suffix": ""}, {"first": "G.-G", "middle": [], "last": "Chang", "suffix": ""}], "year": 2005, "venue": "J. Biol. Chem", "volume": "280", "issn": "", "pages": "22741--22748", "other_ids": {}}, "BIBREF17": {"ref_id": "b17", "title": "Characterization of SARS main protease and inhibitor assay using a fluorogenic substrate", "authors": [{"first": "C.-J", "middle": [], "last": "Kuo", "suffix": ""}, {"first": "Y.-H", "middle": [], "last": "Chi", "suffix": ""}, {"first": "J", "middle": ["T"], "last": "Hsu", "suffix": ""}, {"first": ".-A", "middle": [], "last": "Liang", "suffix": ""}, {"first": "P.-H", "middle": [], "last": "", "suffix": ""}], "year": 2004, "venue": "Biochem. Biophys. Res. Commun", "volume": "318", "issn": "", "pages": "862--867", "other_ids": {}}, "BIBREF18": {"ref_id": "b18", "title": "Characterisation and mutational analysis of an ORF 1a-encoding proteinase domain responsible for proteolytic processing of the infectious bronchitis virus 1a/1b polyprotein", "authors": [{"first": "D", "middle": ["X"], "last": "Liu", "suffix": ""}, {"first": "T", "middle": ["D"], "last": "Brown", "suffix": ""}], "year": 1995, "venue": "Virology", "volume": "209", "issn": "", "pages": "420--427", "other_ids": {}}, "BIBREF19": {"ref_id": "b19", "title": "Determinants of mouse hepatitis virus 3C-like proteinase activity", "authors": [{"first": "Y", "middle": [], "last": "Lu", "suffix": ""}, {"first": "M", "middle": ["R"], "last": "Denison", "suffix": ""}], "year": 1997, "venue": "Virology", "volume": "230", "issn": "", "pages": "335--342", "other_ids": {}}, "BIBREF20": {"ref_id": "b20", "title": "Maturation mechanism of severe acute respiratory syndrome (SARS) coronavirus 3C-like proteinase", "authors": [{"first": "C", "middle": [], "last": "Li", "suffix": ""}, {"first": "Y", "middle": [], "last": "Qi", "suffix": ""}, {"first": "X", "middle": [], "last": "Teng", "suffix": ""}, {"first": "Z", "middle": [], "last": "Yang", "suffix": ""}, {"first": "P", "middle": [], "last": "Wei", "suffix": ""}, {"first": "C", "middle": [], "last": "Zhang", "suffix": ""}, {"first": "L", "middle": [], "last": "Tan", "suffix": ""}, {"first": "L", "middle": [], "last": "Zhou", "suffix": ""}, {"first": "Y", "middle": [], "last": "Liu", "suffix": ""}, {"first": "L", "middle": [], "last": "Lai", "suffix": ""}], "year": 2010, "venue": "J. Biol. Chem", "volume": "285", "issn": "", "pages": "28134--28140", "other_ids": {}}, "BIBREF21": {"ref_id": "b21", "title": "Identification and characterization of a serine-like proteinase of the murine coronavirus MHV-A59", "authors": [{"first": "Y", "middle": [], "last": "Lu", "suffix": ""}, {"first": "X", "middle": [], "last": "Lu", "suffix": ""}, {"first": "M", "middle": ["R"], "last": "Denison", "suffix": ""}], "year": 1995, "venue": "J. Virol", "volume": "69", "issn": "", "pages": "3554--3559", "other_ids": {}}, "BIBREF22": {"ref_id": "b22", "title": "The power of two: protein dimerization in biology", "authors": [{"first": "N", "middle": ["J"], "last": "Marianayagam", "suffix": ""}, {"first": "M", "middle": [], "last": "Sunde", "suffix": ""}, {"first": "J", "middle": ["M"], "last": "Matthews", "suffix": ""}], "year": 2004, "venue": "Trends Biochem. Sci", "volume": "29", "issn": "", "pages": "618--625", "other_ids": {}}, "BIBREF23": {"ref_id": "b23", "title": "Novel fluorogenic substrates for assaying retroviral proteases by resonance energy transfer", "authors": [{"first": "E", "middle": ["D"], "last": "Matayoshi", "suffix": ""}, {"first": "G", "middle": ["T"], "last": "Wang", "suffix": ""}, {"first": "G", "middle": ["A"], "last": "Krafft", "suffix": ""}, {"first": "J", "middle": [], "last": "Erickson", "suffix": ""}], "year": 1990, "venue": "Science", "volume": "247", "issn": "", "pages": "954--958", "other_ids": {}}, "BIBREF24": {"ref_id": "b24", "title": "Phaser crystallographic software", "authors": [{"first": "A", "middle": ["J"], "last": "Mccoy", "suffix": ""}, {"first": "R", "middle": ["W"], "last": "Grosse-Kunstleve", "suffix": ""}, {"first": "P", "middle": ["D"], "last": "Adams", "suffix": ""}, {"first": "M", "middle": ["D"], "last": "Winn", "suffix": ""}, {"first": "L", "middle": ["C"], "last": "Storoni", "suffix": ""}, {"first": "R", "middle": ["J"], "last": "Read", "suffix": ""}], "year": 2007, "venue": "J. Appl. Crystallogr", "volume": "40", "issn": "", "pages": "658--674", "other_ids": {}}, "BIBREF25": {"ref_id": "b25", "title": "Structures of the Middle East respiratory syndrome coronavirus 3C-like protease reveal insights into substrate specificity", "authors": [{"first": "D", "middle": [], "last": "Needle", "suffix": ""}, {"first": "G", "middle": ["T"], "last": "Lountos", "suffix": ""}, {"first": "D", "middle": ["S"], "last": "Waugh", "suffix": ""}], "year": 2015, "venue": "Acta Crystallogr. Sect. D Biol. Crystallogr", "volume": "71", "issn": "", "pages": "1102--1111", "other_ids": {}}, "BIBREF26": {"ref_id": "b26", "title": "Processing of X-ray diffraction data collected in oscillation mode", "authors": [{"first": "J", "middle": [], "last": "Oldham", "suffix": ""}, {"first": "Z", "middle": [], "last": "Otwinowski", "suffix": ""}, {"first": "W", "middle": [], "last": "Minor", "suffix": ""}], "year": 1972, "venue": "Methods Enzymol", "volume": "10", "issn": "", "pages": "307--326", "other_ids": {}}, "BIBREF27": {"ref_id": "b27", "title": "Investigation into the role of potentially contaminated feed as a source of the first-detected outbreaks of porcine epidemic diarrhea in Canada", "authors": [{"first": "J", "middle": [], "last": "Pasick", "suffix": ""}, {"first": "Y", "middle": [], "last": "Berhane", "suffix": ""}, {"first": "D", "middle": [], "last": "Ojkic", "suffix": ""}, {"first": "G", "middle": [], "last": "Maxie", "suffix": ""}, {"first": "C", "middle": [], "last": "Embury-Hyatt", "suffix": ""}, {"first": "K", "middle": [], "last": "Swekla", "suffix": ""}, {"first": "K", "middle": [], "last": "Handel", "suffix": ""}, {"first": "J", "middle": [], "last": "Fairles", "suffix": ""}, {"first": "S", "middle": [], "last": "Alexandersen", "suffix": ""}], "year": 2014, "venue": "Transbound. Emerg. Dis", "volume": "61", "issn": "", "pages": "397--410", "other_ids": {}}, "BIBREF28": {"ref_id": "b28", "title": "A new coronavirus-like particle associated with diarrhea in swine", "authors": [{"first": "M", "middle": ["B"], "last": "Pensaert", "suffix": ""}, {"first": "P", "middle": [], "last": "De Bouck", "suffix": ""}], "year": 1978, "venue": "Arch. Virol", "volume": "58", "issn": "", "pages": "243--247", "other_ids": {}}, "BIBREF29": {"ref_id": "b29", "title": "Deciphering key features in protein structures with the new ENDscript server", "authors": [{"first": "X", "middle": [], "last": "Robert", "suffix": ""}, {"first": "P", "middle": [], "last": "Gouet", "suffix": ""}], "year": 2014, "venue": "Nucleic Acids Res", "volume": "42", "issn": "", "pages": "320--324", "other_ids": {}}, "BIBREF30": {"ref_id": "b30", "title": "On the size of the active site in proteases", "authors": [{"first": "I", "middle": [], "last": "Schechter", "suffix": ""}, {"first": "A", "middle": [], "last": "Berger", "suffix": ""}], "year": 1967, "venue": "I. Papain. Biochem. Biophys. Res. Commun", "volume": "27", "issn": "", "pages": "157--162", "other_ids": {}}, "BIBREF31": {"ref_id": "b31", "title": "Porcine epidemic diarrhea: a review of current epidemiology and available vaccines", "authors": [{"first": "D", "middle": [], "last": "Song", "suffix": ""}, {"first": "H", "middle": [], "last": "Moon", "suffix": ""}, {"first": "B", "middle": [], "last": "Kang", "suffix": ""}], "year": 2015, "venue": "Clin. Exp. Vaccin Res", "volume": "4", "issn": "", "pages": "166--176", "other_ids": {}}, "BIBREF32": {"ref_id": "b32", "title": "Mechanism for controlling the dimer-monomer switch and coupling dimerization to catalysis of the severe acute respiratory syndrome coronavirus 3C-like protease", "authors": [{"first": "J", "middle": [], "last": "Shi", "suffix": ""}, {"first": "J", "middle": [], "last": "Sivaraman", "suffix": ""}, {"first": "J", "middle": [], "last": "Song", "suffix": ""}], "year": 2008, "venue": "J. Virol", "volume": "82", "issn": "", "pages": "4620--4629", "other_ids": {}}, "BIBREF33": {"ref_id": "b33", "title": "Porcine epidemic diarrhoea virus: a comprehensive review of molecular epidemiology, diagnosis, and vaccines", "authors": [{"first": "D", "middle": [], "last": "Song", "suffix": ""}, {"first": "B", "middle": [], "last": "Park", "suffix": ""}], "year": 2012, "venue": "Virus Genes", "volume": "44", "issn": "", "pages": "167--175", "other_ids": {}}, "BIBREF34": {"ref_id": "b34", "title": "Size-distribution analysis of macromolecules by sedimentation velocity ultracentrifugation and lamm equation modeling", "authors": [{"first": "P", "middle": [], "last": "Schuck", "suffix": ""}], "year": 2000, "venue": "Biophys. J", "volume": "78", "issn": "", "pages": "1606--1619", "other_ids": {}}, "BIBREF35": {"ref_id": "b35", "title": "The PyMOL Molecular Graphics System, Version 0.99r1", "authors": [{"first": "L", "middle": ["L C"], "last": "Schrödinger", "suffix": ""}], "year": 2006, "venue": "", "volume": "", "issn": "", "pages": "", "other_ids": {}}, "BIBREF36": {"ref_id": "b36", "title": "3C Protease of enterovirus 68: structure-based design of michael acceptor inhibitors and their broad-spectrum antiviral effects against picornaviruses", "authors": [{"first": "J", "middle": ["Z"], "last": "Tan", "suffix": ""}, {"first": "S", "middle": [], "last": "George", "suffix": ""}, {"first": "Y", "middle": [], "last": "Kusov", "suffix": ""}, {"first": "M", "middle": [], "last": "Perbandt", "suffix": ""}, {"first": "S", "middle": [], "last": "Anemuller", "suffix": ""}, {"first": "J", "middle": ["R"], "last": "Mesters", "suffix": ""}, {"first": "H", "middle": [], "last": "Norder", "suffix": ""}, {"first": "B", "middle": [], "last": "Coutard", "suffix": ""}, {"first": "C", "middle": [], "last": "Lacroix", "suffix": ""}, {"first": "P", "middle": [], "last": "Leyssen", "suffix": ""}, {"first": "J", "middle": [], "last": "Neyts", "suffix": ""}, {"first": "R", "middle": [], "last": "Hilgenfeld", "suffix": ""}], "year": 2013, "venue": "J. Virol", "volume": "87", "issn": "", "pages": "4339--4351", "other_ids": {}}, "BIBREF37": {"ref_id": "b37", "title": "Viral replicase gene products suffice for coronavirus discontinuous transcription", "authors": [{"first": "V", "middle": [], "last": "Thiel", "suffix": ""}, {"first": "J", "middle": [], "last": "Herold", "suffix": ""}, {"first": "B", "middle": [], "last": "Schelle", "suffix": ""}, {"first": "S", "middle": ["G"], "last": "Siddell", "suffix": ""}], "year": 2001, "venue": "J. Virol", "volume": "75", "issn": "", "pages": "6676--6681", "other_ids": {}}, "BIBREF38": {"ref_id": "b38", "title": "Mechanisms and enzymes involved in SARS coronavirus genome expression", "authors": [{"first": "V", "middle": [], "last": "Thiel", "suffix": ""}, {"first": "K", "middle": ["A"], "last": "Ivanov", "suffix": ""}, {"first": "A", "middle": [], "last": "Putics", "suffix": ""}, {"first": "T", "middle": [], "last": "Hertzig", "suffix": ""}, {"first": "B", "middle": [], "last": "Schelle", "suffix": ""}, {"first": "S", "middle": [], "last": "Bayer", "suffix": ""}, {"first": "B", "middle": [], "last": "Weissbrich", "suffix": ""}, {"first": "E", "middle": ["J"], "last": "Snijder", "suffix": ""}, {"first": "H", "middle": [], "last": "Rabenau", "suffix": ""}, {"first": "H", "middle": ["W"], "last": "Doerr", "suffix": ""}, {"first": "A", "middle": ["E"], "last": "Gorbalenya", "suffix": ""}, {"first": "J", "middle": [], "last": "Ziebuhr", "suffix": ""}], "year": 2003, "venue": "J. Gen. Virol", "volume": "84", "issn": "", "pages": "2305--2315", "other_ids": {}}, "BIBREF39": {"ref_id": "b39", "title": "Ligand-induced dimerization of MERS coronavirus nsp5 protease (3CL pro ): implications for nsp5 regulation and the development of antivirals", "authors": [{"first": "S", "middle": [], "last": "Tomar", "suffix": ""}, {"first": "M", "middle": ["L"], "last": "Johnston", "suffix": ""}, {"first": "", "middle": [], "last": "John", "suffix": ""}, {"first": "", "middle": ["S E"], "last": "St", "suffix": ""}, {"first": "H", "middle": ["L"], "last": "Osswald", "suffix": ""}, {"first": "P", "middle": ["R"], "last": "Nyalapatla", "suffix": ""}, {"first": "L", "middle": ["N"], "last": "Paul", "suffix": ""}, {"first": "A", "middle": ["K"], "last": "Ghosh", "suffix": ""}, {"first": "M", "middle": ["R"], "last": "Denison", "suffix": ""}, {"first": "A", "middle": ["D"], "last": "Mesecar", "suffix": ""}], "year": 2015, "venue": "J. Biol. Chem", "volume": "", "issn": "", "pages": "", "other_ids": {}}, "BIBREF40": {"ref_id": "b40", "title": "Distinct characteristics and complex evolution of PEDV strains", "authors": [{"first": "A", "middle": ["N"], "last": "Vlasova", "suffix": ""}, {"first": "D", "middle": [], "last": "Marthaler", "suffix": ""}, {"first": "Q", "middle": ["H"], "last": "Wang", "suffix": ""}, {"first": "M", "middle": ["R"], "last": "Culhane", "suffix": ""}, {"first": "K", "middle": ["D"], "last": "Rossow", "suffix": ""}, {"first": "A", "middle": [], "last": "Rovira", "suffix": ""}, {"first": "J", "middle": [], "last": "Collins", "suffix": ""}, {"first": "L", "middle": ["J"], "last": "Saif", "suffix": ""}], "year": 2013, "venue": "Emerg. Infect. Dis", "volume": "20", "issn": "", "pages": "1620--1628", "other_ids": {}}, "BIBREF41": {"ref_id": "b41", "title": "New variant of porcine epidemic diarrhea virus", "authors": [{"first": "L", "middle": ["Y"], "last": "Wang", "suffix": ""}, {"first": "B", "middle": [], "last": "Byrum", "suffix": ""}, {"first": "Y", "middle": [], "last": "Zhang", "suffix": ""}], "year": 2014, "venue": "Emerg. Infect. Dis", "volume": "20", "issn": "", "pages": "917--919", "other_ids": {}}, "BIBREF42": {"ref_id": "b42", "title": "Porcine epidemic diarrhea virus 3C-Like protease regulates its interferon antagonism by cleaving NEMO", "authors": [{"first": "D", "middle": [], "last": "Wang", "suffix": ""}, {"first": "L", "middle": ["R"], "last": "Fang", "suffix": ""}, {"first": "Y", "middle": ["L"], "last": "Shi", "suffix": ""}, {"first": "H", "middle": [], "last": "Zhang", "suffix": ""}, {"first": "L", "middle": [], "last": "Gao", "suffix": ""}, {"first": "G", "middle": ["Q"], "last": "Peng", "suffix": ""}, {"first": "H", "middle": ["C"], "last": "Chen", "suffix": ""}, {"first": "K", "middle": [], "last": "Li", "suffix": ""}, {"first": "S", "middle": ["B"], "last": "Xiao", "suffix": ""}], "year": 2016, "venue": "J. Virol", "volume": "90", "issn": "", "pages": "2090--2101", "other_ids": {}}, "BIBREF43": {"ref_id": "b43", "title": "The N-terminal octapeptide acts as a dimerization inhibitor of SARS coronavirus 3C-like proteinase", "authors": [{"first": "P", "middle": [], "last": "Wei", "suffix": ""}, {"first": "K", "middle": ["Q"], "last": "Fan", "suffix": ""}, {"first": "H", "middle": [], "last": "Chen", "suffix": ""}, {"first": "L", "middle": [], "last": "Ma", "suffix": ""}, {"first": "C", "middle": ["K"], "last": "Huang", "suffix": ""}, {"first": "L", "middle": [], "last": "Tan", "suffix": ""}, {"first": "D", "middle": [], "last": "Xi", "suffix": ""}, {"first": "C", "middle": ["M"], "last": "Li", "suffix": ""}, {"first": "Y", "middle": [], "last": "Liu", "suffix": ""}, {"first": "A", "middle": ["N"], "last": "Cao", "suffix": ""}, {"first": "L", "middle": ["H"], "last": "Lai", "suffix": ""}], "year": 2006, "venue": "Biochem. Biophys. Res. Commun", "volume": "339", "issn": "", "pages": "865--872", "other_ids": {}}, "BIBREF44": {"ref_id": "b44", "title": "Coronavirus pathogenesis and the emerging pathogen severe acute respiratory syndrome coronavirus. Microbiol", "authors": [{"first": "S", "middle": ["R"], "last": "Weiss", "suffix": ""}, {"first": "S", "middle": [], "last": "Navas-Martin", "suffix": ""}], "year": 2005, "venue": "Mol. Biol. Rev", "volume": "69", "issn": "", "pages": "", "other_ids": {}}, "BIBREF45": {"ref_id": "b45", "title": "An apparently new syndrome of porcine epidemic diarrhoea", "authors": [{"first": "E", "middle": [], "last": "Wood", "suffix": ""}], "year": 1977, "venue": "Vet. Rec", "volume": "100", "issn": "", "pages": "243--244", "other_ids": {}}, "BIBREF46": {"ref_id": "b46", "title": "Design of wide-spectrum inhibitors targeting coronavirus main proteases", "authors": [{"first": "H", "middle": [], "last": "Yang", "suffix": ""}, {"first": "W", "middle": [], "last": "Xie", "suffix": ""}, {"first": "X", "middle": [], "last": "Xue", "suffix": ""}, {"first": "K", "middle": [], "last": "Yang", "suffix": ""}, {"first": "J", "middle": [], "last": "Ma", "suffix": ""}, {"first": "W", "middle": [], "last": "Liang", "suffix": ""}, {"first": "Q", "middle": [], "last": "Zhao", "suffix": ""}, {"first": "Z", "middle": [], "last": "Zhou", "suffix": ""}, {"first": "D", "middle": [], "last": "Pei", "suffix": ""}, {"first": "J", "middle": [], "last": "Ziebuhr", "suffix": ""}], "year": 2005, "venue": "Plos Biol", "volume": "3", "issn": "", "pages": "", "other_ids": {}}, "BIBREF47": {"ref_id": "b47", "title": "The crystal structures of severe acute respiratory syndrome virus main protease and its complex with an inhibitor", "authors": [{"first": "H", "middle": [], "last": "Yang", "suffix": ""}, {"first": "M", "middle": [], "last": "Yang", "suffix": ""}, {"first": "Y", "middle": [], "last": "Ding", "suffix": ""}, {"first": "Y", "middle": [], "last": "Liu", "suffix": ""}, {"first": "Z", "middle": [], "last": "Lou", "suffix": ""}, {"first": "Z", "middle": [], "last": "Zhou", "suffix": ""}, {"first": "L", "middle": [], "last": "Sun", "suffix": ""}, {"first": "L", "middle": [], "last": "Mo", "suffix": ""}, {"first": "S", "middle": [], "last": "Ye", "suffix": ""}, {"first": "H", "middle": [], "last": "Pang", "suffix": ""}], "year": 2003, "venue": "Proc. Natl. Acad. Sci", "volume": "100", "issn": "", "pages": "13190--13195", "other_ids": {}}, "BIBREF48": {"ref_id": "b48", "title": "Virus-encoded proteinases and proteolytic processing in the Nidovirales", "authors": [{"first": "J", "middle": [], "last": "Ziebuhr", "suffix": ""}, {"first": "E", "middle": ["J"], "last": "Snijder", "suffix": ""}, {"first": "A", "middle": ["E"], "last": "Gorbalenya", "suffix": ""}], "year": 2000, "venue": "J. Gen. Virol", "volume": "81", "issn": "", "pages": "853--879", "other_ids": {}}, "BIBREF49": {"ref_id": "b49", "title": "Processing of the human coronavirus 229E replicase polyproteins by the virus-encoded 3C-like proteinase: identification of proteolytic products and cleavage sites common to pp1a and pp1ab", "authors": [{"first": "J", "middle": [], "last": "Ziebuhr", "suffix": ""}, {"first": "S", "middle": ["G"], "last": "Siddell", "suffix": ""}], "year": 1999, "venue": "J. Virol", "volume": "73", "issn": "", "pages": "177--185", "other_ids": {}}, "BIBREF50": {"ref_id": "b50", "title": "The coronavirus replicase", "authors": [{"first": "J", "middle": [], "last": "Ziebuhr", "suffix": ""}], "year": 2005, "venue": "Curr. Top. Microbiol. Immunol", "volume": "287", "issn": "", "pages": "57--94", "other_ids": {}}}, "ref_entries": {"FIGREF0": {"text": "Structure alignment of individual domains of several coronavirus 3CL pro s. A. Schematic overview of superimposed domains of one monomer from several coronavirus 3CL pro s (PEDV 3CL pro , PDB Entry: 4XFQ; SARS-CoV 3CL pro , PDB Entry: 2H2Z; TGEV 3CL pro , PDB Entry: 1LVO; PEDV 3CL pro complex, PDB Entry: 4ZUH; HCoV 229E 3CL pro , PDB Entry; 1P9S). B. RMSD values of individual domains of the PEDV 3CL pro compared with that of four additional enzymes (computed using the PDBeFold service on the European Bioinformatics Institute website).", "latex": null, "type": "figure"}, "FIGREF1": {"text": "A structural diagram of the distribution of hydrophobic and hydrophilic interactions at the dimer interface. A. The figure was generated using the LigPlot þ program.", "latex": null, "type": "figure"}, "FIGREF2": {"text": "Structure of a PEDV 3CL pro variant (C144A) bound to a peptide substrate. A.", "latex": null, "type": "figure"}, "FIGREF3": {"text": "Peptide substrate cleavage assays. A. Cleavage of coronavirus 3CL pro N-terminal substrate.", "latex": null, "type": "figure"}, "TABREF0": {"text": "Data and model statistics.", "latex": null, "type": "table"}, "TABREF1": {"text": "Table 2\nThe comparison of residue-residue interactions at the dimer interface from PEDV 3CL pro with these from other 3CL pro s.", "latex": null, "type": "table", "html": "<html><body><table><tr><td>PEDV 3CLpro </td><td> </td><td>TGEV 3CLpro </td><td> </td><td>HCoV 229E 3CLpro </td><td>SARS-CoV 3CLpro\n</td></tr><tr><td>Monomer A </td><td>Monomer B </td><td>Monomer A </td><td>Monomer B </td><td>Monomer A </td><td>Monomer B </td><td>Monomer A </td><td>Monomer B\n</td></tr><tr><td>1A </td><td>139F,165E </td><td>1S </td><td>139F, 163E </td><td>1A </td><td>139F,165E </td><td>1S </td><td>166E\n</td></tr><tr><td>2G </td><td>138S </td><td>2G </td><td>138S </td><td>2G </td><td>138S </td><td>2G </td><td>139S, 140F\n</td></tr><tr><td>4R </td><td>126G, 286E </td><td>4R </td><td>126G, 286E </td><td>4R </td><td>126G, 286E </td><td>4R </td><td>127Q, 139S, 290E\n</td></tr><tr><td>7A </td><td>124V </td><td>7A </td><td>124V </td><td>7A </td><td>124V </td><td>7A </td><td>125V\n</td></tr><tr><td>10S </td><td>10S </td><td>10S </td><td>10S </td><td>10S </td><td>10S, 14E </td><td>10S </td><td>10S\n</td></tr><tr><td>11G </td><td>14E </td><td>11G </td><td>14E </td><td>11G </td><td>14E </td><td>11G </td><td>14E\n</td></tr><tr><td>14E </td><td>11G </td><td>14E </td><td>11G </td><td>14E </td><td>10S, 11G </td><td>14E </td><td>11G\n</td></tr><tr><td>124V </td><td>7A </td><td>124V </td><td>7A </td><td>124V </td><td>7A </td><td>125V </td><td>7A\n</td></tr><tr><td>126G, 286E </td><td>4R </td><td>126G, 286E </td><td>4R </td><td>126G, 286E </td><td>4R </td><td>127Q, 290E </td><td>4R\n</td></tr><tr><td>138S </td><td>2G,295Q </td><td>138S </td><td>2G, 295Q </td><td>138S </td><td>2G,295Q </td><td>139S </td><td>2G, 299Q\n</td></tr><tr><td>139F, 165E </td><td>1A </td><td>139F, 165E </td><td>1S </td><td>139F, 165E </td><td>1A </td><td>166E </td><td>1S\n</td></tr><tr><td>279G </td><td>281T </td><td>279S </td><td>281G </td><td>281S </td><td>282S\n</td><td> </td><td> </td></tr><tr><td>281T </td><td>276Q </td><td>281G </td><td>279S </td><td>282S </td><td>281S\n</td><td> </td><td> </td></tr><tr><td>295Q </td><td>138S </td><td>295Q </td><td>138S </td><td>295Q </td><td>138S </td><td>299Q </td><td>139S\n</td></tr><tr><td> </td><td> </td><td> </td><td> </td><td> </td><td> </td><td>298R </td><td>123S\n</td></tr></table></body></html>"}}, "back_matter": [{"text": "This work was supported by the National Natural Science Foundation of China (Grant No. 31372440) and the Huazhong Agricultural University Scientific & Technological Self-innovation Foundation (Program Nos. 2012RC008, 2013PY031 and 2662015JQ003). We thank Joe Pasquarella and Dr. Fang Li for discussion and the staff at the SSRF BL-17U beamline for assistance in data collection. Moreover, we also thank research associates at Center for Protein Research (CPR), Huazhong agricultural University, for technical support.", "cite_spans": [], "ref_spans": [], "section": "Acknowledgements"}, {"text": "Supplementary data associated with this article can be found in the online version at http://dx.doi.org/10.1016/j.virol.2016.04.018.", "cite_spans": [], "ref_spans": [], "section": "Appendix A. Supplementary material"}]}