{"paper_id": "454a744cdd86def350e7ab253188aaef3833accd", "metadata": {"title": "The clinical impact of the detection of potential etiologic pathogens of community-acquired pneumonia", "authors": [{"first": "Gita", "middle": [], "last": "Gelfer", "suffix": "", "affiliation": {}, "email": ""}, {"first": "James", "middle": [], "last": "Leggett", "suffix": "", "affiliation": {}, "email": ""}, {"first": "Jillian", "middle": [], "last": "Myers", "suffix": "", "affiliation": {}, "email": ""}, {"first": "Luan", "middle": [], "last": "Wang", "suffix": "", "affiliation": {}, "email": ""}, {"first": "David", "middle": ["N"], "last": "Gilbert", "suffix": "", "affiliation": {}, "email": ""}]}, "abstract": [{"text": "The etiology of community-acquired pneumonia (CAP) is determined in less than half of the patients based on cultures of sputum and blood plus testing urine for the antigens of Streptococcus pneumoniae and Legionella pneumophila. This study added nasal polymerase chain reaction (PCR) probes for S. pneumoniae, Staphylococcus aureus, and respiratory viruses. Serum procalcitonin (PCT) levels were measured. Pathogens were identified in 78% of the patients. For detection of viruses, patients were randomized to either a 5-virus laboratory-generated PCR bundle or the 17-virus FilmArray PCR platform. The FilmArray PCR platform detected more viruses than the laboratory-generated bundle and did so in less than 2 hours. There were fewer days of antibiotic therapy, P = 0.003, in CAP patients with viral infections and a low serum PCT levels.", "cite_spans": [], "ref_spans": [], "section": "Abstract"}], "body_text": [{"text": "Clinical guidelines call for the early initiation of empiric antibiotic therapy for patients with community-acquired pneumonia (CAP) Mandell et al., 2007 . If admitted via the emergency department (ED), it is recommended that antibacterial therapy starts in the ED (Mandell et al., 2007) . De-escalation or discontinuation is recommended when the results of microbiologic tests are available. However, the diagnostic yield from cultures of sputum and blood plus probing urine for the antigen of Streptococcus pneumoniae and Legionella pneumophila is under 50% (Musher et al., 2013) . Further, the results of traditional diagnostics (e.g., sputum culture) are not available for days. As a result, the often broad multidrug empiric antibiotic regimen is often prolonged.", "cite_spans": [{"start": 133, "end": 153, "text": "Mandell et al., 2007", "ref_id": "BIBREF8"}, {"start": 265, "end": 287, "text": "(Mandell et al., 2007)", "ref_id": "BIBREF8"}, {"start": 560, "end": 581, "text": "(Musher et al., 2013)", "ref_id": "BIBREF9"}], "ref_spans": [], "section": "Introduction"}, {"text": "Some physicians may not be willing to discontinue empiric antibiotics despite identification of a potential viral pathogen. Providers oft times express fear that a concomitant invasive bacterial pathogen could be present and will be found later in the sputum culture. To address this issue, our protocol included at least 1 baseline serum procalcitonin (PCT) level. It is generally accepted that serum PCT levels do not increase substantively in pure viral respiratory tract infections (Becker et al., 2008; Gilbert, 2011) . In addition, PCT levels may help interpret culture data. S. pneumoniae, Moraxella catarrhalis, or Haemophilus influenzae may be in the airway of chronic obstructive pulmonary disease patients. PCT levels do not increase unless the latter are causing invasive infection (Falsey et al., 2012) .", "cite_spans": [{"start": 486, "end": 507, "text": "(Becker et al., 2008;", "ref_id": "BIBREF1"}, {"start": 508, "end": 522, "text": "Gilbert, 2011)", "ref_id": "BIBREF4"}, {"start": 794, "end": 815, "text": "(Falsey et al., 2012)", "ref_id": "BIBREF3"}], "ref_spans": [], "section": "Introduction"}, {"text": "Our study was designed to address 3 questions. First, can expansion of the traditional diagnostic test bundle substantively increase the detection of potential etiologic organisms? Second, can molecular diagnostics provide clinicians with actionable data in hours rather than days? Lastly, will providers respond to rapid diagnostic data with adjustments of empiric antibiotic treatment regimens?", "cite_spans": [], "ref_spans": [], "section": "Introduction"}, {"text": "This study was conducted as a nonblinded cluster randomization trial at a 480-bed community teaching hospital in Portland Oregon (Providence Portland Medical Center [PPMC] ). Prior to initiation of the study, the research project was approved by both the Institutional Review Board (IRB) and the Privacy Board of PPMC. As only deidentified chart data were collected, the IRB indicated no need for informed consent. A study information form was available for enrolled patients.", "cite_spans": [{"start": 165, "end": 171, "text": "[PPMC]", "ref_id": null}], "ref_spans": [], "section": "Study conduct"}, {"text": "Prior to study initiation, the investigators reviewed the study protocol with ED nurses, physicians, and clerks (health unit coordinators). Similar meetings were conducted for hospitalists and residents.", "cite_spans": [], "ref_spans": [], "section": "Study conduct"}, {"text": "The diagnosis of CAP was made by ED physicians. If the ED physician determined the need for hospitalization, the patient was enrolled in the study. The ED physician used the hospital's electronic medical record (EMR) to order protocol-mandated diagnostic \"bundles\" and instructed the health unit coordinator to notify the investigators of a new patient. The ED physician initiated empiric antibiotic therapy; the protocol did not dictate or suggest antibiotic management to either the ED or inpatient physicians. The diagnostic test bundle (see below) was initiated by the ED nursing staff.", "cite_spans": [], "ref_spans": [], "section": "Study conduct"}, {"text": "For the vast majority of patients, providers learned of test results via posting in the EMR. There were 2 exceptions. As per hospital policy, providers were immediately notified directly (usually through nursing unit nurses or clerks) of positive blood cultures or identification of influenza. The inpatient physician providers were not officially notified the patient was in the study, although through the prestudy educational sessions, they were aware a hospital-wide CAP diagnostic study investigation was in process. Further, the test bundles ordered in the ED indicated study participation.", "cite_spans": [], "ref_spans": [], "section": "Study conduct"}, {"text": "A common core diagnostic test bundle was applied to all patients in the study: i.e., 2 blood cultures; sputum culture and sensitivity; serum PCT level; and urine antigen testing for L. pneumophila, serogroup 1, and S. pneumoniae. All patients had nasal swabs for polymerase chain reaction (PCR) detection of the lyt gene of S. pneumoniae and the mecA and nuc genes of Staphylococcus aureus. The PCR for S. pneumoniae is an in-house laboratory-generated test available for a number of years as a supplement to the S. pneumoniae urine antigen. The PCR for S. aureus was purchased from Becton-Dickinson (BD Max Staph SR).", "cite_spans": [], "ref_spans": [], "section": "Study design"}, {"text": "PCT levels were determined using an immunoassay developed by Brahms, marketed by bioMérieux, and performed on a Vidas system. An interpretative algorithm was provided with the PCR results. The protocol called for only 1 baseline PCT serum level. Some providers ordered additional levels at their discretion.", "cite_spans": [], "ref_spans": [], "section": "Study design"}, {"text": "PCT results included an interpretative algorithm modeled after the format used in multiple European studies (Schuetz et al., 2012 (Schuetz et al., , 2013 . Values below 0.1 ng/mL were interpreted as \"bacterial etiology very unlikely\"; values of N0.25-0.5 ng/mL, as \"bacterial etiology likely\"; and values of N0.5 ng/mL, as \"bacterial etiology very likely\". The algorithm suggests repeat PCT levels in 4-6 hours in those patients with levels ≤0.25 ng/mL and a clinical picture compatible with an evolving bacterial infection.", "cite_spans": [{"start": 108, "end": 129, "text": "(Schuetz et al., 2012", "ref_id": "BIBREF12"}, {"start": 130, "end": 153, "text": "(Schuetz et al., , 2013", "ref_id": "BIBREF13"}], "ref_spans": [], "section": "Study design"}, {"text": "In addition to the common bundle, patients were cluster randomized in 1-week blocks to undergo additional diagnostic testing with either the PPMC laboratory-generated respiratory pathogen PCR panel (standard) or a commercial faster and broader multiplex PCR panel (FilmArray).", "cite_spans": [], "ref_spans": [], "section": "Study design"}, {"text": "The PPMC laboratory-generated PCR panel probes for influenza A and B, adenovirus, human metapneumovirus, respiratory syncytial virus, and rhinovirus. Specimens are run once a day at least 6 days per week. Results are generally available within 12-48 hours.", "cite_spans": [], "ref_spans": [], "section": "Study design"}, {"text": "On alternate weeks, nasopharyngeal (NP) swabs were processed with a FilmArray multiplex PCR panel (Biofire, Salt Lake City, UT, USA). The FilmArray panel can detect the nucleic acid of 5 types of influenza, 4 types of parainfluenza, rhinovirus/enterovirus, adenovirus, human metapneumovirus, 4 types of coronavirus, respiratory syncytial virus, Mycoplasma pneumoniae, Chlamydophila pneumoniae, and Bordetella pertussis.", "cite_spans": [], "ref_spans": [], "section": "Study design"}, {"text": "The FilmArray assay takes 60 minutes: the total time from specimen collection to reporting of results in the EMR is roughly 2 hours.", "cite_spans": [], "ref_spans": [], "section": "Study design"}, {"text": "A panel of internal medicine residents (see Acknowledgment) extracted data from the patients' EMR. Patients were assigned a study number, and a database file (Filemaker, Pro 13) was established. Data extraction began at enrollment, continued periodically during hospitalization, and was completed postdischarge. All data entry was checked and verified by 2 or 3 of the authors.", "cite_spans": [], "ref_spans": [], "section": "Data collection"}, {"text": "In addition, the infectious disease pharmacists entered all data referable to use of antibiotics and/or anti-influenza therapy. Using a standardized list of the purchase expense of individual antibiotics, 1 investigator (DNG) determined the days of and expense of antimicrobial therapy. On any given day, empiric therapy with 3 different antibiotics, regardless of the number of doses, was defined as 3 days of therapy (DOT). The length, or number of days, of therapy (LOT), regardless of the number of drugs administered each day, was also calculated. The days of antibiotic therapy and length of antibiotic therapy were normalized to 1000 hospital patient days.", "cite_spans": [], "ref_spans": [], "section": "Data collection"}, {"text": "Inclusion required an ED diagnosis of CAP of sufficient severity to require hospitalization. Postdiagnosis, the ED physician enrolled the patient and initiated the appropriate order set.", "cite_spans": [], "ref_spans": [], "section": "Inclusion and exclusion criteria"}, {"text": "Patients were required to be 18 years of age or older. Patients were excluded if it was not possible to obtain an NP swab or if it was decided to withhold antibiotics and initiate comfort care management.", "cite_spans": [], "ref_spans": [], "section": "Inclusion and exclusion criteria"}, {"text": "Postenrollment, patients were excluded and hence nonevaluable if 2 sites of infection were present: e.g., CAP plus a non-CAP infection.", "cite_spans": [], "ref_spans": [], "section": "Inclusion and exclusion criteria"}, {"text": "The final database for each enrolled patient was reviewed by 2 of the investigators (JL and DNG) for the purpose of final categorization as per the definitions below. In the event of disagreement, the case was adjudicated by a third investigator (GG). The criteria for the assigned final clinical diagnosis were as follows:", "cite_spans": [], "ref_spans": [], "section": "Final clinical categorization"}, {"text": "Postadmission clinical, laboratory, and imaging studies document an alternative noninfectious diagnosis. Congestive heart failure is an example.", "cite_spans": [], "ref_spans": [], "section": "Uninfected"}, {"text": "Proven: presence of a bacterial pathogen in sputum, blood, or pleural fluid. Also accepted was presence of S. pneumoniae by NP swab PCR and/or a positive S. pneumoniae urine antigen in a patient with a clinical syndrome of pneumonia in the absence of other detected pathogens.", "cite_spans": [], "ref_spans": [], "section": "Bacterial pneumonia"}, {"text": "Presumptive: The presence of multifocal pulmonary infiltrates and detection of S. pneumoniae or S. aureus by PCR of a nasal swab in patients with a clinical syndrome of pneumonia and in whom it was not possible to obtain sputum or a bronchoalveolar lavage specimen.", "cite_spans": [], "ref_spans": [], "section": "Bacterial pneumonia"}, {"text": "In the presence of clinical pneumonia, a serum PCT level of ≥0.25 ng/mL was accepted as presumptive evidence of bacterial pneumonia in the absence of detection of a bacterial pathogen. A common example is the patient with documented aspiration. The 0.25 ng/mL \"cut-off\" used is based on a large number of European trials of PCT levels in patients with a variety of lower respiratory tract infections (Schuetz et al., 2012 (Schuetz et al., , 2013 .", "cite_spans": [{"start": 400, "end": 421, "text": "(Schuetz et al., 2012", "ref_id": "BIBREF12"}, {"start": 422, "end": 445, "text": "(Schuetz et al., , 2013", "ref_id": "BIBREF13"}], "ref_spans": [], "section": "Bacterial pneumonia"}, {"text": "Identification of the presence of adenovirus, coronavirus, human metapneumovirus, parainfluenza, respiratory syncytial virus, or rhinovirus by 1 of the PCR probes and a compatible clinical syndrome.", "cite_spans": [], "ref_spans": [], "section": "Viral pneumonia"}, {"text": "Patients were considered coinfected if diagnostic data demonstrated the presence of both a viral and a bacterial pathogen. If a respiratory virus was detected and the serum PCT was above 0.5 ng/mL and/or a bacterial pathogen was found in the sputum culture, the patient was assumed to have a dual infection with the identified virus and bacteria.", "cite_spans": [], "ref_spans": [], "section": "Coinfected"}, {"text": "The detected bacterial and viral pathogens are identified as \"potential\" etiologic agents. No seroconversion studies were performed to document invasive disease.", "cite_spans": [], "ref_spans": [], "section": "Coinfected"}, {"text": "Each patient file was reviewed by 3 investigators (GG, JL, and DG). A patient was considered evaluable only if all protocol-required diagnostic studies were performed. The sputum culture and sensitivity was an exception. The absence of a sputum culture was acceptable if, after due diligence, no sputum could be obtained.", "cite_spans": [], "ref_spans": [], "section": "Determination of protocol adherence of patient data"}, {"text": "Patients were considered nonevaluable if the diagnostic panels were incomplete, the patient died within 48 hours, the diagnosis of CAP was incorrect, or the patient had a dual infection (e.g., CAP and urinary tract infection [UTI] ).", "cite_spans": [{"start": 225, "end": 230, "text": "[UTI]", "ref_id": null}], "ref_spans": [], "section": "Determination of protocol adherence of patient data"}, {"text": "Each patient file was reviewed by 3 investigators to determine if the patient's pneumonia diagnosis was, in hindsight, correct. Of those patients with a clinical pneumonia syndrome, the investigators classified the etiology of the pneumonia in 1 of 4 ways: viral, bacterial, or a combination of viral and bacterial, or, when no pathogen was found, clinical pneumonia of unclear etiology. If a respiratory virus was detected, an associated bacterial infection was deemed present if a bacterial pathogen was identified by culture or PCR or urine antigens or if the serum PCT concentration was N0.5 ng/mL.", "cite_spans": [], "ref_spans": [], "section": "Determination of protocol adherence of patient data"}, {"text": "For comparisons between the 2 diagnostic methods, t test or Wilcoxon test was performed for continuous variables, and chi-square test or Fisher's exact test was performed for categorical variables. Kruskal-Wallis test or 1-way analysis of variance test was used for comparisons among the 3 distinct etiology groups (viral, bacterial, or a combination of viral and bacterial).", "cite_spans": [], "ref_spans": [], "section": "Statistics"}, {"text": "From January to March of 2014, the ED admitted 142 patients with a diagnosis of CAP. During \"standard\" PPMC diagnostics weeks, 69 patients were enrolled, and during \"FilmArray\" weeks, 73 patients were enrolled (Fig. 1) . Of the 69 patients in the standard group, 41 patients were nonevaluable due to a failure to obtain all elements of the protocol-required diagnostic bundle in 25 patients, presence of a noninfectious disease causing pulmonary infiltrates (e.g., congestive heart failure) in 15 patients, and documented presence of a second site of active infection (e.g., UTI) in 1 patient. Of the remaining 28 standard patients, 1 or more pathogens were identified in 24 (85%).", "cite_spans": [], "ref_spans": [{"start": 210, "end": 218, "text": "(Fig. 1)", "ref_id": null}], "section": "Results"}, {"text": "Of the 73 patients in the FilmArray group, 42 patients were not evaluable. In 32 patients, there was a failure to obtain all elements of the diagnostic bundle; in 9 patients, the final clinical diagnosis excluded pneumonia; and 1 patient had a second site of active infection. Of the remaining 31 patients, 1 or more pathogens were identified in 22 (70%) patients.", "cite_spans": [], "ref_spans": [], "section": "Results"}, {"text": "The high rate of incomplete diagnostics was largely a result of problems with the order sets of the EMR. The hospital had just installed a new EMR. Despite ordering the proper bundle, the EMR either failed to input the complete order set and/or failed to notify the nursing staff of the orders. The problem was gradually rectified during the first 3-4 weeks of the study. Of note, the nonevaluable patients were otherwise similar to those evaluated with respect to demographics, comorbidities, and other features listed in Table 1 ", "cite_spans": [], "ref_spans": [{"start": 523, "end": 530, "text": "Table 1", "ref_id": "TABREF1"}], "section": "Results"}, {"text": "There were no demographic or clinical feature differences between the standard and the FilmArray patients (Table 1 ). The elevated pneumonia severity index values support the need for hospitalization (Becker et al., 2008) . Selected comorbidities were evenly distributed. More FilmArray patients were prescribed outpatient oral antibiotics immediately prior to hospitalization (P = 0.04).", "cite_spans": [{"start": 200, "end": 221, "text": "(Becker et al., 2008)", "ref_id": "BIBREF1"}], "ref_spans": [{"start": 106, "end": 114, "text": "(Table 1", "ref_id": "TABREF1"}], "section": "Patient characteristics"}, {"text": "Combining patients enrolled in both the standard and the FilmArray groups, 1 or more potential pathogens were identified in 46 of 59 (78%) patients. In the 46 evaluable patients with positive tests, 3 patient groups were identified (Table 2 ). In 18 of 59 (30.5%) patients, only a respiratory virus was detected. In 15 of 59 patients (25.5%), only a potential bacterial pathogen was found. In 13 of 59 (22.0%) of patients, both potential viral and bacterial pathogens were detected.", "cite_spans": [], "ref_spans": [{"start": 232, "end": 240, "text": "(Table 2", "ref_id": "TABREF2"}], "section": "Potential microbial etiology of the patients' CAP"}, {"text": "A common diagnostic bundle for hospitalized patients with CAP is the combination of cultures of sputum and blood plus detection of antigens of S. pneumoniae and L. pneumophila in urine. However, we were able to obtain a valid sputum specimen for culture in only 27 of the 59 (46%) evaluable patients. Overall, a positive sputum culture occurred in 8 patients, positive blood cultures in 2 patients, and positive urine antigen tests in 16 patients. In short, the traditional test combination would have identified a potential etiologic pathogen in only 16 of 59 (27%) patients (Table 3) .", "cite_spans": [], "ref_spans": [{"start": 576, "end": 585, "text": "(Table 3)", "ref_id": "TABREF3"}], "section": "Potential microbial etiology of the patients' CAP"}, {"text": "The diagnostic yield was increased by the NP swab for S. pneumoniae PCR and the anterior nasal swab for S. aureus PCR. Although S. pneumoniae was detected by blood culture in 2 patients, by urine antigen in 5 patients, and by NP PCR in 11 patients (Table 2) , S. aureus was detected in sputum in only 1 patient but by anterior nasal swab in 5 patients. In sum, adding the S. pneumoniae and S. aureus PCR positive results increased the positive diagnostic yield to 33 of 59 (56%) patients.", "cite_spans": [], "ref_spans": [{"start": 248, "end": 257, "text": "(Table 2)", "ref_id": "TABREF2"}], "section": "Potential microbial etiology of the patients' CAP"}, {"text": "The addition of the probes for respiratory viruses detected virus in 31 of the 59 (53%) evaluable patients and 31 of the 46 (67%) patients with an identified pathogen. The hospital standard PCR panel detected virus in 14 patients versus the FilmArray detection of virus in 17 patients. Coronavirus, not part of the hospital PCR panel, was detected in 6 patients. The FilmArray also detected C. pneumoniae in 1 patient.", "cite_spans": [], "ref_spans": [], "section": "Potential microbial etiology of the patients' CAP"}, {"text": "Of note, influenza was not detected in any patient randomized to FilmArray but was detected by the standard panel in early January. We hypothesize that this discrepancy was largely due to timing. Enrollment in our study was initiated in the second week of January 2014 with the PPMC standard panel. State-wide influenza surveillance indicated that influenza activity occurred in November and December of 2013 and largely disappeared by mid-January 2014.", "cite_spans": [], "ref_spans": [], "section": "Potential microbial etiology of the patients' CAP"}, {"text": "The turnaround time (processing, running, and reporting) for the 20 target FilmArray multiplex PCR panel was 1.8 ± 0.3 hours as compared to 26.7 ± 16 hours for the PPMC 5 virus standard PCR viral panel (P b 0.001). Time to results for the urine antigens of S. pneumoniae and L. pneumophila ranged from 5 to 7 hours. For the PCR of nasal secretions for S. aureus and S. pneumoniae, results were reported between 12 and 30 hours. Hence, the FilmArray PCR provided the quickest turnaround time.", "cite_spans": [], "ref_spans": [], "section": "Turnaround time"}, {"text": "Admission serum PCT concentrations were a mean of 0.2 ± 0.2 ng/mL in patients with only a viral pathogen present. In patients infected with a bacterial pathogen, the mean value was 5.9 ± 12.5 ng/mL; if both bacterial and viral pathogens were detected, the mean value was 9.6 ± 19.6 ng/mL (Fig. 2) . The difference between the viral group and either of the other 2 groups was highly statistically significant (P b 0.001).", "cite_spans": [], "ref_spans": [{"start": 288, "end": 296, "text": "(Fig. 2)", "ref_id": null}], "section": "Serum PCT concentrations"}, {"text": "In only 1 instance did the serum PCT help distinguish colonization from invasion. The patient's NP swab was positive for human metapneumovirus. The nasal PCR was also positive for MRSA. The PCT level was normal, and no treatment for MRSA was given.", "cite_spans": [], "ref_spans": [], "section": "Serum PCT concentrations"}, {"text": "As per clinical guidelines on the management of patients with CAP of sufficient severity to require hospitalization, all enrolled evaluable patients received their first doses of empiric antibiotic therapy within 6 hours of arrival and before leaving the ED (Mandell et al., 2007) . In order to determine the influence of aggressive diagnostic testing on patient care, the antibiotic DOT normalized to 1000 patient days, the LOT per 1000 patient days, and the dollar cost of therapy per 1000 patient days were determined (Table 4 ). The DOT was significantly lower in the virus-only group (P = 0.003). There was a trend toward a shorter LOT in the virus-only group compared to the other 2 etiologic categories. Regardless of the microbial etiology of CAP or the diagnostic bundle, there was no significant difference in the cost of antibiotics.", "cite_spans": [{"start": 258, "end": 280, "text": "(Mandell et al., 2007)", "ref_id": "BIBREF8"}], "ref_spans": [{"start": 521, "end": 529, "text": "(Table 4", "ref_id": "TABREF4"}], "section": "Influence of diagnostics on antibacterial therapy"}, {"text": "We asked if the faster result reporting of the FilmArray panel would influence antibiotic use in the patients with pure viral pneumonia. The LOT/1000 patient days was 917 ± 220 (n = 7) in the standard diagnostic group and 683 ± 317 (n = 11) in the FilmArray patients (P = 0.052).", "cite_spans": [], "ref_spans": [], "section": "Influence of diagnostics on antibacterial therapy"}, {"text": "In 18 patients, the NP PCR detected a pathogenic virus in the absence of pathogenic bacteria. The clinical signs and symptoms, white blood cell (WBC) and differential, chest x-ray, and serum PCT levels were consistent with a viral pneumonia. Nonetheless, in only 4 patients was the empiric antibiotic discontinued within 48 hours of physician receipt of the PCR and PCT results.", "cite_spans": [], "ref_spans": [], "section": "Influence of diagnostics on antibacterial therapy"}, {"text": "With the diagnostic bundles employed, an etiologic pathogen(s) was detected in 70% or 85% of the evaluable patients. Further, using the FilmArray multiplex PCR panel, the average time to detection of a viral pathogen was reduced to less than 2 hours. Serum PCT levels successfully separated pure viral infection from bacterial or mixed viral-bacterial pneumonia. Although the days of antibiotic therapy were less with \"pure\" viral infection, the full potential for antibiotic de-escalation was not achieved.", "cite_spans": [], "ref_spans": [], "section": "Discussion"}, {"text": "Both of our diagnostic bundles detected a high percentage of potential etiologic pathogens. Of the total of 59 evaluable patients, a candidate etiologic organism(s) was found in 46 (78%). Of the 46 patients with a demonstrable pathogen(s), the multiplex viral PCR panels were positive in 31 (67%). The high positive yield was also the result of identification of the pneumococcus by PCR in 11 of 46 (24%) and S. aureus by PCR in 5 of 46 (11%). If the diagnostic bundle was limited to cultures of sputum and blood plus urine antigens, the diagnostic yield would fall from 78% to 20 of the 46 (43%) patients with positive diagnostic tests or 20 of the 59 (34%) total evaluable patients. We were unable to obtain sputum for culture in 46% of the patients. (78) a Of the total of 11 patients with a positive NP swab PCR for S. pneumoniae, there were 4 patients with a concomitant positive S. pneumoniae urine antigen, 3 patients with concomitant positive sputum culture, and 2 patients with concomitant positive blood cultures. b S. pneumoniae in 2; MSSA in 1. c S. pneumoniae in 2; M. tuberculosis in 1. The reported diagnostic yield in the literature varies with the extent of, and type of, testing performed. In a 2008 study, a pathogen was detected in only 24% of patients when testing was limited to bacterial cultures of the airway and blood plus urine antigen testing for L. pneumophila (Restrepo et al., 2008) . In a 2010 study of 126 patients from Israel, a putative pathogen was detected in 84 (67%) of the patients. The high yield was achieved with NP swabs subjected to PCR probes for M. pneumoniae, C. pneumoniae, L. pneumoniae, and 5 genera of respiratory viruses. In addition, urine was probed for S. pneumoniae antigen, and sequential sera were collected to measure possible antibody increases to 3 atypical pathogens and 3 genera of viruses (Shibi et al., 2010) .", "cite_spans": [{"start": 1390, "end": 1413, "text": "(Restrepo et al., 2008)", "ref_id": "BIBREF11"}, {"start": 1854, "end": 1874, "text": "(Shibi et al., 2010)", "ref_id": "BIBREF14"}], "ref_spans": [], "section": "Diagnostic yield"}, {"text": "Also in 2010, a similarly exhaustive diagnostic study of 184 Swedish patients identified an etiologic pathogen in 124 (67%); in a subset of 38 patients subjected to seroconversion studies, the diagnostic yield was an impressive 89% (Johansson et al., 2010) . Etiologic diagnosis by seroconversion helps in epidemiologic studies but does not assist clinical management. Musher et al. (2013) attempted to determine the etiology of CAP in 215 adult patients admitted over 1 year (2011) (2012) . Diagnostic tests included blood and airway cultures, urine antigens, and a 15-virus FilmArray PCR panel. An adequate sputum sample was obtained in only 30% of the cases. A bacterial pathogen was found in 28% and a viral pathogen in 20% of 215 patients. PCT levels were elevated in patients with a bacterial infection and were low in those deemed uninfected or those with a viral infection.", "cite_spans": [{"start": 232, "end": 256, "text": "(Johansson et al., 2010)", "ref_id": "BIBREF6"}, {"start": 369, "end": 389, "text": "Musher et al. (2013)", "ref_id": "BIBREF9"}, {"start": 476, "end": 482, "text": "(2011)", "ref_id": null}, {"start": 483, "end": 489, "text": "(2012)", "ref_id": null}], "ref_spans": [], "section": "Diagnostic yield"}, {"text": "The emerging picture is the previously underappreciated role of viral pathogens in adults. In addition, it is now possible to find candidate pathogens in roughly 80% of hospitalized patients with CAP. For purposes of antibiotic stewardship, it is desirable to identify pathogens as quickly as possible.", "cite_spans": [], "ref_spans": [], "section": "Diagnostic yield"}, {"text": "Our results confirm that it is possible to rapidly identify potential etiologic organisms. The results of the FilmArray were available within a mean of 1.8 hours, urine antigens in 5-7 hours, and our laboratorygenerated standard PCR respiratory virus panel, and PCRs for S. aureus and S. pneumoniae within 12-30 hours.", "cite_spans": [], "ref_spans": [], "section": "Time to results and de-escalation"}, {"text": "As treating physicians remain skeptical and providers express worry that there might be a concomitant bacterial infection, we added at least 1 serum PCT level. A large number of European and now study groups in the United States confirm that pure viral infections do not result in elevated PCT levels (Becker et al., 2008; Falsey et al., 2012; Gilbert, 2011; Schuetz et al., 2012 Schuetz et al., , 2013 . The serum levels of PCT increase with invasive bacterial infection or a combined bacterial-viral infection. Further, the short 2-hour turnaround time for PCT levels should assist in early treatment decisions.", "cite_spans": [{"start": 301, "end": 322, "text": "(Becker et al., 2008;", "ref_id": "BIBREF1"}, {"start": 323, "end": 343, "text": "Falsey et al., 2012;", "ref_id": "BIBREF3"}, {"start": 344, "end": 358, "text": "Gilbert, 2011;", "ref_id": "BIBREF4"}, {"start": 359, "end": 379, "text": "Schuetz et al., 2012", "ref_id": "BIBREF12"}, {"start": 380, "end": 402, "text": "Schuetz et al., , 2013", "ref_id": "BIBREF13"}], "ref_spans": [], "section": "Time to results and de-escalation"}, {"text": "Our hypothesis was that rapid identification of a microbial etiology would translate into a de-escalation to specific therapy for bacterial pathogens; to influenza antivirals from empiric therapy if germane; or, in the case of other viral pathogens, to no antibiotic therapy.", "cite_spans": [], "ref_spans": [], "section": "Influence of rapid viral diagnosis on antibiotic de-escalation"}, {"text": "The study data indicate that detection of a viral pathogen in concert with a low PCT serum concentration resulted in fewer days of antibiotic therapy. This favorable trend was offset by the incomplete response of providers; antibiotics were discontinued in only 4 of 18 patients with apparent viral infections.", "cite_spans": [], "ref_spans": [], "section": "Influence of rapid viral diagnosis on antibiotic de-escalation"}, {"text": "Our results confirm and extend the work of others. Oosterheert et al. (2005) randomized adult patients with lower respiratory tract infections to standard diagnostics (sputum and blood cultures plus urine antigen testing for L. pneumophila) or a laboratory-generated multiplex real-time PCR panel for 5 viruses and 3 atypical pathogens, hence a diagnostic bundle similar to our \"standard\" arm. Despite PCR detection of a respiratory virus, antibiotic therapy was discontinued in only 2 of 11 patients. The authors speculate that providers justified continuing antibiotics pending final results of sputum culture.", "cite_spans": [{"start": 51, "end": 76, "text": "Oosterheert et al. (2005)", "ref_id": "BIBREF10"}], "ref_spans": [], "section": "Influence of rapid viral diagnosis on antibiotic de-escalation"}, {"text": "A recent trial from Branche et al employed a protocol almost identical to ours (Branche et al.; Gilbert, 2015) . Adults with lower respiratory tract infections were randomized to either standard-of-care diagnostics or \"intervention\" with the FilmArray platform and PCT levels plus blood and sputum cultures and urine antigens. In a subgroup of the intervention arm, there was a trend toward fewer days of antibiotic therapy in those with an identified viral pathogen and a low PCT level. Fewer patients in this subset were discharged on antibiotics.", "cite_spans": [{"start": 79, "end": 95, "text": "(Branche et al.;", "ref_id": "BIBREF2"}, {"start": 96, "end": 110, "text": "Gilbert, 2015)", "ref_id": "BIBREF5"}], "ref_spans": [], "section": "Influence of rapid viral diagnosis on antibiotic de-escalation"}, {"text": "he results of the latter 3 trials and our data clearly demonstrate that the value of rapid diagnostics and PCT levels will only be realized with realtime communication between a member of an antibiotic stewardship team and the treating physicians (Gilbert, 2015) . With time and repetition, it is anticipated that treating physicians will become more knowledgeable and more confident in the interpretation of the PCR and PCT results.", "cite_spans": [{"start": 247, "end": 262, "text": "(Gilbert, 2015)", "ref_id": "BIBREF5"}], "ref_spans": [], "section": "Influence of rapid viral diagnosis on antibiotic de-escalation"}, {"text": "The small size of the study groups is a major limitation. It is our intent to repeat the study with the goal of a substantively larger enrollment.", "cite_spans": [], "ref_spans": [], "section": "Limitations"}, {"text": "Our study differed from others in the use of nasal swab PCRs for S. pneumoniae and S. aureus. The previous studies designed to determine the etiology of CAP have not routinely used NP swabs PCR testing for detection of S. pneumoniae. In a rigorous pneumonia study in HIV-infected adults, NP swabs performed as well as PCR probes of sputum (Albrich et al., 2014) . Hence, with the difficulty of obtaining valid sputum specimens, NP samples have the advantage of ease of specimen collection.", "cite_spans": [{"start": 339, "end": 361, "text": "(Albrich et al., 2014)", "ref_id": "BIBREF0"}], "ref_spans": [], "section": "Limitations"}, {"text": "The value of anterior nasal swab PCRs to detect S. aureus is reported helpful in patients with ventilator-associated pneumonia (Leone et al., 2013) . We are unaware of previous studies that evaluated the performance of S. aureus nasal swab PCR as a standard part of a CAP diagnostic bundle.", "cite_spans": [{"start": 127, "end": 147, "text": "(Leone et al., 2013)", "ref_id": "BIBREF7"}], "ref_spans": [], "section": "Limitations"}, {"text": "Lastly, we did not perform acute and convalescent antibody titers. Hence, some of the pathogens detected may have been colonizing the airway. Patients were enrolled and considered evaluable only if their clinical, laboratory, and radiographic picture were compatible with an active pneumonia. ", "cite_spans": [], "ref_spans": [], "section": "Limitations"}, {"text": "The data presented support the routine inclusion of S. aureus and S. pneumoniae nasal swab PCRs in the routine diagnostic package for CAP.", "cite_spans": [], "ref_spans": [], "section": "Conclusion"}, {"text": "Both of our diagnostic bundles performed well in the identification of candidate etiologic pathogens. The importance of respiratory viruses is evident by the detection of respiratory viruses alone or in combination with bacteria in 52.5% of the evaluable patients.", "cite_spans": [], "ref_spans": [], "section": "Conclusion"}, {"text": "Further, the FilmArray PCR platform results and the serum PCT levels were available in less than 2 hours. Unfortunately, the full clinical benefit of rapidly detecting both an airway virus and a low serum PCT was not realized. The results of this study and other similar investigations demonstrate the clear need for expanded antibiotic stewardship that includes direct and timely discussion of the results of diagnostic tests with patient caregivers.", "cite_spans": [], "ref_spans": [], "section": "Conclusion"}], "bib_entries": {"BIBREF0": {"ref_id": "b0", "title": "Genomic load from sputum samples and nasopharyngeal swabs for diagnosis of pneumococcal pneumonia in HIV-infected adults", "authors": [{"first": "W", "middle": ["C"], "last": "Albrich", "suffix": ""}, {"first": "S", "middle": ["A"], "last": "Madhi", "suffix": ""}, {"first": "P", "middle": ["V"], "last": "Adrian", "suffix": ""}, {"first": "J-N", "middle": [], "last": "Telles", "suffix": ""}, {"first": "G", "middle": [], "last": "Parankos-Baccala", "suffix": ""}, {"first": "K", "middle": ["P"], "last": "Klugman", "suffix": ""}], "year": 2014, "venue": "J Clin Microbiol", "volume": "52", "issn": "", "pages": "4224--4233", "other_ids": {}}, "BIBREF1": {"ref_id": "b1", "title": "Procalcitonin assay in systemic inflammation, infection, and sepsis: clinical utility and limitations", "authors": [{"first": "K", "middle": ["L"], "last": "Becker", "suffix": ""}, {"first": "R", "middle": [], "last": "Snider", "suffix": ""}, {"first": "E", "middle": ["S"], "last": "Nylen", "suffix": ""}], "year": 2008, "venue": "Crit Care Med", "volume": "36", "issn": "", "pages": "941--52", "other_ids": {}}, "BIBREF2": {"ref_id": "b2", "title": "Serum procalcitonin and viral testing to guide antibiotic use for respiratory infections in hospitalized adults: a randomized controlled trial", "authors": [{"first": "A", "middle": ["R"], "last": "Branche", "suffix": ""}, {"first": "E", "middle": ["E"], "last": "Walsh", "suffix": ""}, {"first": "R", "middle": [], "last": "Vargas", "suffix": ""}, {"first": "B", "middle": [], "last": "Hulbert", "suffix": ""}, {"first": "M", "middle": ["A"], "last": "Formica", "suffix": ""}, {"first": "A", "middle": [], "last": "Baran", "suffix": ""}], "year": 2015, "venue": "J Infect Dis", "volume": "", "issn": "", "pages": "", "other_ids": {"DOI": ["10.1093/infdis/jiv253"]}}, "BIBREF3": {"ref_id": "b3", "title": "Utility of serum procalcitonin values in patients with acute exacerbation of chronic obstructive pulmonary disease: a cautionary note", "authors": [{"first": "A", "middle": ["R"], "last": "Falsey", "suffix": ""}, {"first": "K", "middle": ["L"], "last": "Becker", "suffix": ""}, {"first": "A", "middle": ["J"], "last": "Swinburne", "suffix": ""}, {"first": "E", "middle": ["S"], "last": "Nylen", "suffix": ""}, {"first": "R", "middle": ["H"], "last": "Snider", "suffix": ""}, {"first": "M", "middle": ["A"], "last": "Formica", "suffix": ""}], "year": 2012, "venue": "Int J COPD", "volume": "7", "issn": "", "pages": "127--162", "other_ids": {}}, "BIBREF4": {"ref_id": "b4", "title": "Procalcitonin as a biomarker in respiratory tract infection", "authors": [{"first": "D", "middle": ["N"], "last": "Gilbert", "suffix": ""}], "year": 2011, "venue": "Clin Infect Dis", "volume": "52", "issn": "", "pages": "", "other_ids": {}}, "BIBREF5": {"ref_id": "b5", "title": "Where do we go from here (editorial)", "authors": [{"first": "D", "middle": ["N"], "last": "Gilbert", "suffix": ""}], "year": 2015, "venue": "J Infect Dis", "volume": "", "issn": "", "pages": "", "other_ids": {"DOI": ["10.1093/infdis/jiv253"]}}, "BIBREF6": {"ref_id": "b6", "title": "Etiology of communityacquired pneumonia: increased yield with new diagnostic methods", "authors": [{"first": "N", "middle": [], "last": "Johansson", "suffix": ""}, {"first": "M", "middle": [], "last": "Kalin", "suffix": ""}, {"first": "A", "middle": [], "last": "Tiveljung-Lindell", "suffix": ""}, {"first": "C", "middle": ["G"], "last": "Giske", "suffix": ""}, {"first": "F", "middle": [], "last": "Hedlund", "suffix": ""}], "year": 2010, "venue": "Clin Infect Dis", "volume": "50", "issn": "", "pages": "", "other_ids": {}}, "BIBREF7": {"ref_id": "b7", "title": "Routine use of Staphylococcus aureus rapid diagnostic test in patients with suspected ventilatorassociated pneumonia", "authors": [{"first": "M", "middle": [], "last": "Leone", "suffix": ""}, {"first": "F", "middle": [], "last": "Malavieille", "suffix": ""}, {"first": "L", "middle": [], "last": "Papazian", "suffix": ""}, {"first": "B", "middle": [], "last": "Meyssignac", "suffix": ""}, {"first": "N", "middle": [], "last": "Cassir", "suffix": ""}, {"first": "J", "middle": [], "last": "Textoris", "suffix": ""}], "year": 2013, "venue": "Crit Care", "volume": "17", "issn": "", "pages": "", "other_ids": {}}, "BIBREF8": {"ref_id": "b8", "title": "Infectious Diseases Society of America/American Thoracic Society consensus guidelines on the management of community-acquired pneumonia in adults", "authors": [{"first": "L", "middle": ["A"], "last": "Mandell", "suffix": ""}, {"first": "R", "middle": ["G"], "last": "Wunderink", "suffix": ""}, {"first": "A", "middle": [], "last": "Anzueto", "suffix": ""}, {"first": "J", "middle": ["G"], "last": "Bartlett", "suffix": ""}, {"first": "G", "middle": ["D"], "last": "Campbell", "suffix": ""}, {"first": "N", "middle": ["C"], "last": "Dean", "suffix": ""}], "year": 2007, "venue": "Clin Infect Dis", "volume": "44", "issn": "", "pages": "27--72", "other_ids": {}}, "BIBREF9": {"ref_id": "b9", "title": "Can an etiologic agent be identified in adults who are hospitalized for community-acquired pneumonia: results of a one-year study", "authors": [{"first": "D", "middle": ["M"], "last": "Musher", "suffix": ""}, {"first": "I", "middle": ["L"], "last": "Roig", "suffix": ""}, {"first": "G", "middle": [], "last": "Cazares", "suffix": ""}, {"first": "C", "middle": ["E"], "last": "Stager", "suffix": ""}, {"first": "N", "middle": [], "last": "Logan", "suffix": ""}, {"first": "H", "middle": [], "last": "Safar", "suffix": ""}], "year": 2013, "venue": "J Infect", "volume": "67", "issn": "", "pages": "11--19", "other_ids": {}}, "BIBREF10": {"ref_id": "b10", "title": "Impact of rapid detection of viral and atypical bacterial pathogens by real-time polymerase chain reaction for patients with lower respiratory tract infection", "authors": [{"first": "J", "middle": ["J"], "last": "Oosterheert", "suffix": ""}, {"first": "A", "middle": ["M"], "last": "Vanloon", "suffix": ""}, {"first": "R", "middle": [], "last": "Schuurman", "suffix": ""}, {"first": "Hoepelman", "middle": [], "last": "Andy", "suffix": ""}, {"first": "I", "middle": ["M"], "last": "Hak", "suffix": ""}, {"first": "E", "middle": [], "last": "Thijsen", "suffix": ""}, {"first": "S", "middle": [], "last": "", "suffix": ""}], "year": 2005, "venue": "Clin Infect Dis", "volume": "41", "issn": "", "pages": "1438--1482", "other_ids": {}}, "BIBREF11": {"ref_id": "b11", "title": "A comparative study of community-acquired pneumonia patients admitted to the ward and ICU", "authors": [{"first": "M", "middle": ["I"], "last": "Restrepo", "suffix": ""}, {"first": "E", "middle": ["M"], "last": "Mortensen", "suffix": ""}, {"first": "J", "middle": ["A"], "last": "Velez", "suffix": ""}, {"first": "C", "middle": [], "last": "Frei", "suffix": ""}, {"first": "A", "middle": [], "last": "Anzueto", "suffix": ""}], "year": 2008, "venue": "Chest", "volume": "133", "issn": "", "pages": "", "other_ids": {}}, "BIBREF12": {"ref_id": "b12", "title": "Procalcitonin to guide initiation and duration of antibiotic treatment in acute respiratory infections: an individual patient data meta-analysis", "authors": [{"first": "P", "middle": [], "last": "Schuetz", "suffix": ""}, {"first": "M", "middle": [], "last": "Briel", "suffix": ""}, {"first": "M", "middle": [], "last": "Christ-Crain", "suffix": ""}, {"first": "D", "middle": [], "last": "Stolz", "suffix": ""}, {"first": "L", "middle": [], "last": "Bouadma", "suffix": ""}, {"first": "M", "middle": [], "last": "Wolff", "suffix": ""}], "year": 2012, "venue": "Clin Infect Dis", "volume": "55", "issn": "", "pages": "651--62", "other_ids": {}}, "BIBREF13": {"ref_id": "b13", "title": "Clinical outcomes associated with procalcitonin algorithms to guide antibiotic therapy in respiratory tract infections", "authors": [{"first": "P", "middle": [], "last": "Schuetz", "suffix": ""}, {"first": "M", "middle": [], "last": "Briel", "suffix": ""}, {"first": "B", "middle": [], "last": "Mueller", "suffix": ""}], "year": 2013, "venue": "JAMA", "volume": "309", "issn": "", "pages": "717--725", "other_ids": {}}, "BIBREF14": {"ref_id": "b14", "title": "Etiology of community-acquired pneumonia in hospitalized patients in northern Israel", "authors": [{"first": "F", "middle": [], "last": "Shibi", "suffix": ""}, {"first": "B", "middle": [], "last": "Chazan", "suffix": ""}, {"first": "O", "middle": [], "last": "Nitzan", "suffix": ""}, {"first": "E", "middle": [], "last": "Flatau", "suffix": ""}, {"first": "H", "middle": [], "last": "Edelstein", "suffix": ""}, {"first": "O", "middle": [], "last": "Blondheim", "suffix": ""}], "year": 2010, "venue": "Isr Med Assoc J", "volume": "12", "issn": "", "pages": "", "other_ids": {}}}, "ref_entries": {"TABREF0": {"text": ".", "latex": null, "type": "table", "html": "<html><body><table><tr><td>Etiologic category </td><td>Method of detection </td><td>Standard bundle (n = 28) </td><td>FilmArray bundle (n = 31) </td><td>Total (%) of 59\n</td></tr><tr><td>No pathogen identified </td><td>Not applicable </td><td>4 </td><td>9 </td><td>22.0\n</td></tr><tr><td>Virus only </td><td>Multiplex PCR </td><td>7 </td><td>11 </td><td>30.5\n</td></tr><tr><td>Bacterial only, total </td><td> </td><td>10 </td><td>5 </td><td>25.5\n</td></tr><tr><td>S. pneumoniae PCRa </td><td>4 </td><td>3\n</td><td> </td></tr><tr><td> </td><td>S. pneumoniae urine antigena </td><td>1 </td><td>1\n</td><td> </td></tr><tr><td> </td><td>S. aureus PCR </td><td>3 </td><td>1\n</td><td> </td></tr><tr><td> </td><td>L. pneumophila urine antigen </td><td>1 </td><td>0\n</td><td> </td></tr><tr><td> </td><td>C. pneumophila PCR </td><td>N/A </td><td>1\n</td><td> </td></tr><tr><td> </td><td>Sputum culture </td><td>3b </td><td>3c\n</td><td> </td></tr><tr><td> </td><td>Blood culture </td><td>(S. pneumoniae) 2\n</td><td> </td><td> </td></tr><tr><td> </td><td>No bacteria; procalcitonin ↑ </td><td>0 </td><td>0\n</td><td> </td></tr><tr><td>Virus a bacteria, total </td><td> </td><td>7 </td><td>6 </td><td>22.0\n</td></tr><tr><td>Virus: </td><td>Viral PCR </td><td>7 </td><td>6\n</td><td> </td></tr><tr><td>Bacteria: </td><td>S. pneumoniae PCRa </td><td>2 </td><td>2\n</td><td> </td></tr><tr><td>S. pneumoniae urine antigena </td><td>2 </td><td>1\n</td><td> </td></tr><tr><td> </td><td>S. aureus PCR </td><td>1 </td><td>1\n</td><td> </td></tr><tr><td> </td><td>L. pneumophila urine antigen </td><td>0 </td><td>0\n</td><td> </td></tr><tr><td> </td><td>Sputum culture </td><td>0 </td><td>2\n</td><td> </td></tr><tr><td> </td><td>Blood culture </td><td>0 </td><td>0\n</td><td> </td></tr><tr><td> </td><td>No bacteria; PCT ↑ </td><td>3 </td><td>0\n</td><td> </td></tr><tr><td>Total number of pathogens detected </td><td>All methods </td><td>24/28 (85) </td><td>22/31 (70) </td><td>46/59 (78)\n</td></tr></table></body></html>"}, "TABREF1": {"text": "Characteristics of the evaluable patients.", "latex": null, "type": "table"}, "TABREF2": {"text": "Potential microbial etiology of community-acquired pneumonia in 59 evaluable patients.", "latex": null, "type": "table", "html": "<html><body><table><tr><td>Etiologic category </td><td>Method of detection </td><td>Standard bundle (n = 28) </td><td>FilmArray bundle (n = 31) </td><td>Total (%) of 59\n</td></tr><tr><td>No pathogen identified </td><td>Not applicable </td><td>4 </td><td>9 </td><td>22.0\n</td></tr><tr><td>Virus only </td><td>Multiplex PCR </td><td>7 </td><td>11 </td><td>30.5\n</td></tr><tr><td>Bacterial only, total </td><td> </td><td>10 </td><td>5 </td><td>25.5\n</td></tr><tr><td>S. pneumoniae PCRa </td><td>4 </td><td>3\n</td><td> </td></tr><tr><td> </td><td>S. pneumoniae urine antigena </td><td>1 </td><td>1\n</td><td> </td></tr><tr><td> </td><td>S. aureus PCR </td><td>3 </td><td>1\n</td><td> </td></tr><tr><td> </td><td>L. pneumophila urine antigen </td><td>1 </td><td>0\n</td><td> </td></tr><tr><td> </td><td>C. pneumophila PCR </td><td>N/A </td><td>1\n</td><td> </td></tr><tr><td> </td><td>Sputum culture </td><td>3b </td><td>3c\n</td><td> </td></tr><tr><td> </td><td>Blood culture </td><td>(S. pneumoniae) 2\n</td><td> </td><td> </td></tr><tr><td> </td><td>No bacteria; procalcitonin ↑ </td><td>0 </td><td>0\n</td><td> </td></tr><tr><td>Virus a bacteria, total </td><td> </td><td>7 </td><td>6 </td><td>22.0\n</td></tr><tr><td>Virus: </td><td>Viral PCR </td><td>7 </td><td>6\n</td><td> </td></tr><tr><td>Bacteria: </td><td>S. pneumoniae PCRa </td><td>2 </td><td>2\n</td><td> </td></tr><tr><td>S. pneumoniae urine antigena </td><td>2 </td><td>1\n</td><td> </td></tr><tr><td> </td><td>S. aureus PCR </td><td>1 </td><td>1\n</td><td> </td></tr><tr><td> </td><td>L. pneumophila urine antigen </td><td>0 </td><td>0\n</td><td> </td></tr><tr><td> </td><td>Sputum culture </td><td>0 </td><td>2\n</td><td> </td></tr><tr><td> </td><td>Blood culture </td><td>0 </td><td>0\n</td><td> </td></tr><tr><td> </td><td>No bacteria; PCT ↑ </td><td>3 </td><td>0\n</td><td> </td></tr><tr><td>Total number of pathogens detected </td><td>All methods </td><td>24/28 (85) </td><td>22/31 (70) </td><td>46/59 (78)\n</td></tr></table></body></html>"}, "TABREF3": {"text": "Comparison of potential etiologic pathogens detected by PPMC standard diagnostic bundle or diagnostic bundle with FilmArray multiplex PCR substituted for PPMC viral PCR respiratory virus panel.", "latex": null, "type": "table"}, "TABREF4": {"text": "Influence of diagnostic results on antibacterial therapy (mean ± SD).", "latex": null, "type": "table", "html": "<html><body><table><tr><td>Pathogen </td><td>Diagnostic method </td><td>No. of patients </td><td>Cost of therapy ($) per 1000 patient days </td><td>LOT (days) per 1000 patient days </td><td>DOT per 1000 patient days\n</td></tr><tr><td>Bacteria </td><td>FilmArray </td><td>5 </td><td>9882 ± 6853 </td><td>950 ± 112 </td><td>1413 ± 84\n</td></tr><tr><td>Standard </td><td>10 </td><td>19,890 ± 26,825 </td><td>962 ± 145 </td><td>1519 ± 302\n</td></tr><tr><td>Bacteria + virus </td><td>Combined </td><td>15 </td><td>16,553 ± 23,357 </td><td>958 ± 131 </td><td>1484 ± 252**\n</td></tr><tr><td>FilmArray </td><td>6 </td><td>39,962 ± 73,506 </td><td>964 ± 67 </td><td>1700 ± 309\n</td></tr><tr><td>Standard </td><td>7 </td><td>13,445 ± 14,849 </td><td>967 ± 87 </td><td>1628 ± 467\n</td></tr><tr><td>Virus </td><td>Combined </td><td>13 </td><td>25,683 ± 50,506 </td><td>966 ± 75 </td><td>1661 ± 387**\n</td></tr><tr><td>FilmArray </td><td>11 </td><td>8063 ± 5701 </td><td>683 ± 317 </td><td>1011 ± 451\n</td></tr><tr><td>Standard </td><td>7 </td><td>5717 ± 5085 </td><td>917 ± 220 </td><td>1464 ± 824\n</td></tr><tr><td> </td><td>Combined </td><td>18 </td><td>7150 ± 5443 </td><td>774 ± 300 </td><td>1188 ± 641*\n</td></tr></table></body></html>"}, "TABREF5": {"text": "Table 3\nComparison of potential etiologic pathogens detected by PPMC standard diagnostic bundle or diagnostic bundle with FilmArray multiplex PCR substituted for PPMC viral PCR re-", "latex": null, "type": "table", "html": "<html><body><table><tr><td>spiratory virus panel.\nPathogen identified </td><td>Standard\n(24 patients)\n</td><td>FilmArray (22 patients)\n</td></tr><tr><td>Patients with viral pathogen only\n</td><td> </td><td> </td></tr><tr><td>Adenovirus </td><td>0 </td><td>1\n</td></tr><tr><td>Coronavirus </td><td>0 </td><td>5\n</td></tr><tr><td>Human metapneumovirus </td><td>3 </td><td>2\n</td></tr><tr><td>Influenza </td><td>3 </td><td>0\n</td></tr><tr><td>Parainfluenza </td><td>0 </td><td>0\n</td></tr><tr><td>Respiratory syncytial virus </td><td>1 </td><td>3\n</td></tr><tr><td>Rhinovirus </td><td>0 </td><td>0\n</td></tr><tr><td>Patients with bacterial pathogen only\n</td><td> </td><td> </td></tr><tr><td>Streptococcus anginosus </td><td>1 </td><td>0\n</td></tr><tr><td>S. pneumoniae </td><td>5 </td><td>2\n</td></tr><tr><td>S. pneumoniae + MRSA </td><td>0 </td><td>1\n</td></tr><tr><td>Streptococcus pneumoniae + MSSA </td><td>1 </td><td>0\n</td></tr><tr><td>MRSA only </td><td>2 </td><td>0\n</td></tr><tr><td>C. pneumoniae </td><td> </td><td>1\n</td></tr><tr><td>L. pneumophila </td><td>1 </td><td>0\n</td></tr><tr><td>Patients with both viral and bacterial pathogens\n</td><td> </td></tr><tr><td>Influenza + elevated PCT </td><td>3\n</td><td> </td></tr><tr><td>S. pneumoniae + influenza </td><td>0 </td><td>0\n</td></tr><tr><td>S. pneumoniae + adenovirus </td><td>1 </td><td>1\n</td></tr><tr><td>S. pneumoniae + hMPV </td><td>1 </td><td>1\n</td></tr><tr><td>S. pneumoniae + rhinovirus </td><td>0 </td><td>1\n</td></tr><tr><td>S. pneumoniae + RSV </td><td>1 </td><td>1\n</td></tr><tr><td>MRSA + hMPV </td><td> </td><td>1\n</td></tr><tr><td> </td><td>M. catarrhalis + coronavirus </td><td>1\n</td></tr></table></body></html>"}}, "back_matter": [{"text": "Thanks to PPMC residents who helped extract patient data: Alter, A; Gelfer, G; Powell, J; Schultz, L; Sisk, M;, Stevens, J; and Bajema, K. Administrative support: Siegenthaler, C. Pharmacy support: Myers, J.; and Rob Denison; ED physicians, nurses, and unit coordinators. Help with study design and data management: John Heffner, MD. Advice on metrics of antibiotic use: Ron Polk.This study was supported by a research grant from bioMérieux, Salt Lake City, UT, USA.", "cite_spans": [], "ref_spans": [], "section": "Acknowledgments"}]}